xiongGithub1/autosarTc234/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC23X_AB_PB_BASE_V501_REL-334/TC23x_ABstep/Aurix_MC-ISAR/general/tricore/inc/TC23x/IfxEth_bf.h
/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN25 */
#define IFX_ETH_ACCEN0_EN25_OFF (25u)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN26 */
#define IFX_ETH_ACCEN0_EN26_LEN (1u)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN26 */
#define IFX_ETH_ACCEN0_EN26_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN26 */
#define IFX_ETH_ACCEN0_EN26_OFF (26u)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN27 */
#define IFX_ETH_ACCEN0_EN27_LEN (1u)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN27 */
#define IFX_ETH_ACCEN0_EN27_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN27 */
#define IFX_ETH_ACCEN0_EN27_OFF (27u)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN28 */
#define IFX_ETH_ACCEN0_EN28_LEN (1u)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN28 */
#define IFX_ETH_ACCEN0_EN28_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN28 */
#define IFX_ETH_ACCEN0_EN28_OFF (28u)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN29 */
#define IFX_ETH_ACCEN0_EN29_LEN (1u)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN29 */
#define IFX_ETH_ACCEN0_EN29_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN29 */
#define IFX_ETH_ACCEN0_EN29_OFF (29u)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN2 */
#define IFX_ETH_ACCEN0_EN2_LEN (1u)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN2 */
#define IFX_ETH_ACCEN0_EN2_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN2 */
#define IFX_ETH_ACCEN0_EN2_OFF (2u)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN30 */
#define IFX_ETH_ACCEN0_EN30_LEN (1u)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN30 */
#define IFX_ETH_ACCEN0_EN30_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN30 */
#define IFX_ETH_ACCEN0_EN30_OFF (30u)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN31 */
#define IFX_ETH_ACCEN0_EN31_LEN (1u)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN31 */
#define IFX_ETH_ACCEN0_EN31_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN31 */
#define IFX_ETH_ACCEN0_EN31_OFF (31u)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN3 */
#define IFX_ETH_ACCEN0_EN3_LEN (1u)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN3 */
#define IFX_ETH_ACCEN0_EN3_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN3 */
#define IFX_ETH_ACCEN0_EN3_OFF (3u)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN4 */
#define IFX_ETH_ACCEN0_EN4_LEN (1u)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN4 */
#define IFX_ETH_ACCEN0_EN4_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN4 */
#define IFX_ETH_ACCEN0_EN4_OFF (4u)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN5 */
#define IFX_ETH_ACCEN0_EN5_LEN (1u)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN5 */
#define IFX_ETH_ACCEN0_EN5_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN5 */
#define IFX_ETH_ACCEN0_EN5_OFF (5u)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN6 */
#define IFX_ETH_ACCEN0_EN6_LEN (1u)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN6 */
#define IFX_ETH_ACCEN0_EN6_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN6 */
#define IFX_ETH_ACCEN0_EN6_OFF (6u)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN7 */
#define IFX_ETH_ACCEN0_EN7_LEN (1u)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN7 */
#define IFX_ETH_ACCEN0_EN7_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN7 */
#define IFX_ETH_ACCEN0_EN7_OFF (7u)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN8 */
#define IFX_ETH_ACCEN0_EN8_LEN (1u)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN8 */
#define IFX_ETH_ACCEN0_EN8_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN8 */
#define IFX_ETH_ACCEN0_EN8_OFF (8u)

/** \brief  Length for Ifx_ETH_ACCEN0_Bits.EN9 */
#define IFX_ETH_ACCEN0_EN9_LEN (1u)

/** \brief  Mask for Ifx_ETH_ACCEN0_Bits.EN9 */
#define IFX_ETH_ACCEN0_EN9_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_ACCEN0_Bits.EN9 */
#define IFX_ETH_ACCEN0_EN9_OFF (9u)

/** \brief  Length for Ifx_ETH_AHB_OR_AXI_STATUS_Bits.AXIRDSTS */
#define IFX_ETH_AHB_OR_AXI_STATUS_AXIRDSTS_LEN (1u)

/** \brief  Mask for Ifx_ETH_AHB_OR_AXI_STATUS_Bits.AXIRDSTS */
#define IFX_ETH_AHB_OR_AXI_STATUS_AXIRDSTS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_AHB_OR_AXI_STATUS_Bits.AXIRDSTS */
#define IFX_ETH_AHB_OR_AXI_STATUS_AXIRDSTS_OFF (1u)

/** \brief  Length for Ifx_ETH_AHB_OR_AXI_STATUS_Bits.AXWHSTS */
#define IFX_ETH_AHB_OR_AXI_STATUS_AXWHSTS_LEN (1u)

/** \brief  Mask for Ifx_ETH_AHB_OR_AXI_STATUS_Bits.AXWHSTS */
#define IFX_ETH_AHB_OR_AXI_STATUS_AXWHSTS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_AHB_OR_AXI_STATUS_Bits.AXWHSTS */
#define IFX_ETH_AHB_OR_AXI_STATUS_AXWHSTS_OFF (0u)

/** \brief  Length for Ifx_ETH_BUS_MODE_Bits.AAL */
#define IFX_ETH_BUS_MODE_AAL_LEN (1u)

/** \brief  Mask for Ifx_ETH_BUS_MODE_Bits.AAL */
#define IFX_ETH_BUS_MODE_AAL_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_BUS_MODE_Bits.AAL */
#define IFX_ETH_BUS_MODE_AAL_OFF (25u)

/** \brief  Length for Ifx_ETH_BUS_MODE_Bits.ATDS */
#define IFX_ETH_BUS_MODE_ATDS_LEN (1u)

/** \brief  Mask for Ifx_ETH_BUS_MODE_Bits.ATDS */
#define IFX_ETH_BUS_MODE_ATDS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_BUS_MODE_Bits.ATDS */
#define IFX_ETH_BUS_MODE_ATDS_OFF (7u)

/** \brief  Length for Ifx_ETH_BUS_MODE_Bits.DA */
#define IFX_ETH_BUS_MODE_DA_LEN (1u)

/** \brief  Mask for Ifx_ETH_BUS_MODE_Bits.DA */
#define IFX_ETH_BUS_MODE_DA_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_BUS_MODE_Bits.DA */
#define IFX_ETH_BUS_MODE_DA_OFF (1u)

/** \brief  Length for Ifx_ETH_BUS_MODE_Bits.DSL */
#define IFX_ETH_BUS_MODE_DSL_LEN (5u)

/** \brief  Mask for Ifx_ETH_BUS_MODE_Bits.DSL */
#define IFX_ETH_BUS_MODE_DSL_MSK (0x1fu)

/** \brief  Offset for Ifx_ETH_BUS_MODE_Bits.DSL */
#define IFX_ETH_BUS_MODE_DSL_OFF (2u)

/** \brief  Length for Ifx_ETH_BUS_MODE_Bits.FB */
#define IFX_ETH_BUS_MODE_FB_LEN (1u)

/** \brief  Mask for Ifx_ETH_BUS_MODE_Bits.FB */
#define IFX_ETH_BUS_MODE_FB_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_BUS_MODE_Bits.FB */
#define IFX_ETH_BUS_MODE_FB_OFF (16u)

/** \brief  Length for Ifx_ETH_BUS_MODE_Bits.MB */
#define IFX_ETH_BUS_MODE_MB_LEN (1u)

/** \brief  Mask for Ifx_ETH_BUS_MODE_Bits.MB */
#define IFX_ETH_BUS_MODE_MB_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_BUS_MODE_Bits.MB */
#define IFX_ETH_BUS_MODE_MB_OFF (26u)

/** \brief  Length for Ifx_ETH_BUS_MODE_Bits.PBL */
#define IFX_ETH_BUS_MODE_PBL_LEN (6u)

/** \brief  Mask for Ifx_ETH_BUS_MODE_Bits.PBL */
#define IFX_ETH_BUS_MODE_PBL_MSK (0x3fu)

/** \brief  Offset for Ifx_ETH_BUS_MODE_Bits.PBL */
#define IFX_ETH_BUS_MODE_PBL_OFF (8u)

/** \brief  Length for Ifx_ETH_BUS_MODE_Bits.PBLx8 */
#define IFX_ETH_BUS_MODE_PBLX8_LEN (1u)

