xiongGithub1/autosarTc234/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC23X_AB_PB_BASE_V501_REL-334/TC23x_ABstep/Aurix_MC-ISAR/general/tricore/inc/TC23x/IfxEth_bf.h
/** \brief  Mask for Ifx_ETH_BUS_MODE_Bits.PBLx8 */
#define IFX_ETH_BUS_MODE_PBLX8_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_BUS_MODE_Bits.PBLx8 */
#define IFX_ETH_BUS_MODE_PBLX8_OFF (24u)

/** \brief  Length for Ifx_ETH_BUS_MODE_Bits.PR */
#define IFX_ETH_BUS_MODE_PR_LEN (2u)

/** \brief  Mask for Ifx_ETH_BUS_MODE_Bits.PR */
#define IFX_ETH_BUS_MODE_PR_MSK (0x3u)

/** \brief  Offset for Ifx_ETH_BUS_MODE_Bits.PR */
#define IFX_ETH_BUS_MODE_PR_OFF (14u)

/** \brief  Length for Ifx_ETH_BUS_MODE_Bits.PRWG */
#define IFX_ETH_BUS_MODE_PRWG_LEN (2u)

/** \brief  Mask for Ifx_ETH_BUS_MODE_Bits.PRWG */
#define IFX_ETH_BUS_MODE_PRWG_MSK (0x3u)

/** \brief  Offset for Ifx_ETH_BUS_MODE_Bits.PRWG */
#define IFX_ETH_BUS_MODE_PRWG_OFF (28u)

/** \brief  Length for Ifx_ETH_BUS_MODE_Bits.RPBL */
#define IFX_ETH_BUS_MODE_RPBL_LEN (6u)

/** \brief  Mask for Ifx_ETH_BUS_MODE_Bits.RPBL */
#define IFX_ETH_BUS_MODE_RPBL_MSK (0x3fu)

/** \brief  Offset for Ifx_ETH_BUS_MODE_Bits.RPBL */
#define IFX_ETH_BUS_MODE_RPBL_OFF (17u)

/** \brief  Length for Ifx_ETH_BUS_MODE_Bits.SWR */
#define IFX_ETH_BUS_MODE_SWR_LEN (1u)

/** \brief  Mask for Ifx_ETH_BUS_MODE_Bits.SWR */
#define IFX_ETH_BUS_MODE_SWR_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_BUS_MODE_Bits.SWR */
#define IFX_ETH_BUS_MODE_SWR_OFF (0u)

/** \brief  Length for Ifx_ETH_BUS_MODE_Bits.TXPR */
#define IFX_ETH_BUS_MODE_TXPR_LEN (1u)

/** \brief  Mask for Ifx_ETH_BUS_MODE_Bits.TXPR */
#define IFX_ETH_BUS_MODE_TXPR_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_BUS_MODE_Bits.TXPR */
#define IFX_ETH_BUS_MODE_TXPR_OFF (27u)

/** \brief  Length for Ifx_ETH_BUS_MODE_Bits.USP */
#define IFX_ETH_BUS_MODE_USP_LEN (1u)

/** \brief  Mask for Ifx_ETH_BUS_MODE_Bits.USP */
#define IFX_ETH_BUS_MODE_USP_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_BUS_MODE_Bits.USP */
#define IFX_ETH_BUS_MODE_USP_OFF (23u)

/** \brief  Length for Ifx_ETH_CLC_Bits.DISR */
#define IFX_ETH_CLC_DISR_LEN (1u)

/** \brief  Mask for Ifx_ETH_CLC_Bits.DISR */
#define IFX_ETH_CLC_DISR_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_CLC_Bits.DISR */
#define IFX_ETH_CLC_DISR_OFF (0u)

/** \brief  Length for Ifx_ETH_CLC_Bits.DISS */
#define IFX_ETH_CLC_DISS_LEN (1u)

/** \brief  Mask for Ifx_ETH_CLC_Bits.DISS */
#define IFX_ETH_CLC_DISS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_CLC_Bits.DISS */
#define IFX_ETH_CLC_DISS_OFF (1u)

/** \brief  Length for
 * Ifx_ETH_CURRENT_HOST_RECEIVE_BUFFER_ADDRESS_Bits.CURRBUFAPTR */
#define IFX_ETH_CURRENT_HOST_RECEIVE_BUFFER_ADDRESS_CURRBUFAPTR_LEN (32u)

/** \brief  Mask for
 * Ifx_ETH_CURRENT_HOST_RECEIVE_BUFFER_ADDRESS_Bits.CURRBUFAPTR */
#define IFX_ETH_CURRENT_HOST_RECEIVE_BUFFER_ADDRESS_CURRBUFAPTR_MSK (0xffffffffu)

/** \brief  Offset for
 * Ifx_ETH_CURRENT_HOST_RECEIVE_BUFFER_ADDRESS_Bits.CURRBUFAPTR */
#define IFX_ETH_CURRENT_HOST_RECEIVE_BUFFER_ADDRESS_CURRBUFAPTR_OFF (0u)

/** \brief  Length for Ifx_ETH_CURRENT_HOST_RECEIVE_DESCRIPTOR_Bits.CURRDESAPTR */
#define IFX_ETH_CURRENT_HOST_RECEIVE_DESCRIPTOR_CURRDESAPTR_LEN (32u)

/** \brief  Mask for Ifx_ETH_CURRENT_HOST_RECEIVE_DESCRIPTOR_Bits.CURRDESAPTR */
#define IFX_ETH_CURRENT_HOST_RECEIVE_DESCRIPTOR_CURRDESAPTR_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_CURRENT_HOST_RECEIVE_DESCRIPTOR_Bits.CURRDESAPTR */
#define IFX_ETH_CURRENT_HOST_RECEIVE_DESCRIPTOR_CURRDESAPTR_OFF (0u)

/** \brief  Length for
 * Ifx_ETH_CURRENT_HOST_TRANSMIT_BUFFER_ADDRESS_Bits.CURTBUFAPTR */
#define IFX_ETH_CURRENT_HOST_TRANSMIT_BUFFER_ADDRESS_CURTBUFAPTR_LEN (32u)

/** \brief  Mask for
 * Ifx_ETH_CURRENT_HOST_TRANSMIT_BUFFER_ADDRESS_Bits.CURTBUFAPTR */
#define IFX_ETH_CURRENT_HOST_TRANSMIT_BUFFER_ADDRESS_CURTBUFAPTR_MSK (0xffffffffu)

/** \brief  Offset for
 * Ifx_ETH_CURRENT_HOST_TRANSMIT_BUFFER_ADDRESS_Bits.CURTBUFAPTR */
#define IFX_ETH_CURRENT_HOST_TRANSMIT_BUFFER_ADDRESS_CURTBUFAPTR_OFF (0u)

/** \brief  Length for Ifx_ETH_CURRENT_HOST_TRANSMIT_DESCRIPTOR_Bits.CURTDESAPTR */
#define IFX_ETH_CURRENT_HOST_TRANSMIT_DESCRIPTOR_CURTDESAPTR_LEN (32u)

/** \brief  Mask for Ifx_ETH_CURRENT_HOST_TRANSMIT_DESCRIPTOR_Bits.CURTDESAPTR */
#define IFX_ETH_CURRENT_HOST_TRANSMIT_DESCRIPTOR_CURTDESAPTR_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_CURRENT_HOST_TRANSMIT_DESCRIPTOR_Bits.CURTDESAPTR */
#define IFX_ETH_CURRENT_HOST_TRANSMIT_DESCRIPTOR_CURTDESAPTR_OFF (0u)

/** \brief  Length for Ifx_ETH_DEBUG_Bits.RFCFCSTS */
#define IFX_ETH_DEBUG_RFCFCSTS_LEN (2u)

/** \brief  Mask for Ifx_ETH_DEBUG_Bits.RFCFCSTS */
#define IFX_ETH_DEBUG_RFCFCSTS_MSK (0x3u)

/** \brief  Offset for Ifx_ETH_DEBUG_Bits.RFCFCSTS */
#define IFX_ETH_DEBUG_RFCFCSTS_OFF (1u)

/** \brief  Length for Ifx_ETH_DEBUG_Bits.RPESTS */
#define IFX_ETH_DEBUG_RPESTS_LEN (1u)

/** \brief  Mask for Ifx_ETH_DEBUG_Bits.RPESTS */
#define IFX_ETH_DEBUG_RPESTS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_DEBUG_Bits.RPESTS */
#define IFX_ETH_DEBUG_RPESTS_OFF (0u)

/** \brief  Length for Ifx_ETH_DEBUG_Bits.RRCSTS */
#define IFX_ETH_DEBUG_RRCSTS_LEN (2u)

/** \brief  Mask for Ifx_ETH_DEBUG_Bits.RRCSTS */
#define IFX_ETH_DEBUG_RRCSTS_MSK (0x3u)

/** \brief  Offset for Ifx_ETH_DEBUG_Bits.RRCSTS */
#define IFX_ETH_DEBUG_RRCSTS_OFF (5u)

/** \brief  Length for Ifx_ETH_DEBUG_Bits.RWCSTS */
#define IFX_ETH_DEBUG_RWCSTS_LEN (1u)

/** \brief  Mask for Ifx_ETH_DEBUG_Bits.RWCSTS */
#define IFX_ETH_DEBUG_RWCSTS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_DEBUG_Bits.RWCSTS */
#define IFX_ETH_DEBUG_RWCSTS_OFF (4u)

/** \brief  Length for Ifx_ETH_DEBUG_Bits.RXFSTS */
#define IFX_ETH_DEBUG_RXFSTS_LEN (2u)

/** \brief  Mask for Ifx_ETH_DEBUG_Bits.RXFSTS */
#define IFX_ETH_DEBUG_RXFSTS_MSK (0x3u)

/** \brief  Offset for Ifx_ETH_DEBUG_Bits.RXFSTS */
#define IFX_ETH_DEBUG_RXFSTS_OFF (8u)

/** \brief  Length for Ifx_ETH_DEBUG_Bits.TFCSTS */
#define IFX_ETH_DEBUG_TFCSTS_LEN (2u)

/** \brief  Mask for Ifx_ETH_DEBUG_Bits.TFCSTS */
#define IFX_ETH_DEBUG_TFCSTS_MSK (0x3u)

/** \brief  Offset for Ifx_ETH_DEBUG_Bits.TFCSTS */
#define IFX_ETH_DEBUG_TFCSTS_OFF (17u)

/** \brief  Length for Ifx_ETH_DEBUG_Bits.TPESTS */
#define IFX_ETH_DEBUG_TPESTS_LEN (1u)

/** \brief  Mask for Ifx_ETH_DEBUG_Bits.TPESTS */
#define IFX_ETH_DEBUG_TPESTS_MSK (0x1u)

