xiongGithub1/autosarTc234/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC23X_AB_PB_BASE_V501_REL-334/TC23x_ABstep/Aurix_MC-ISAR/general/tricore/inc/TC23x/IfxEth_bf.h
/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.HDSEL */
#define IFX_ETH_HW_FEATURE_HDSEL_OFF (2u)

/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.INTTSEN */
#define IFX_ETH_HW_FEATURE_INTTSEN_LEN (1u)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.INTTSEN */
#define IFX_ETH_HW_FEATURE_INTTSEN_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.INTTSEN */
#define IFX_ETH_HW_FEATURE_INTTSEN_OFF (25u)

/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.L3L4FLTREN */
#define IFX_ETH_HW_FEATURE_L3L4FLTREN_LEN (1u)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.L3L4FLTREN */
#define IFX_ETH_HW_FEATURE_L3L4FLTREN_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.L3L4FLTREN */
#define IFX_ETH_HW_FEATURE_L3L4FLTREN_OFF (7u)

/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.MGKSEL */
#define IFX_ETH_HW_FEATURE_MGKSEL_LEN (1u)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.MGKSEL */
#define IFX_ETH_HW_FEATURE_MGKSEL_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.MGKSEL */
#define IFX_ETH_HW_FEATURE_MGKSEL_OFF (10u)

/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.MIISEL */
#define IFX_ETH_HW_FEATURE_MIISEL_LEN (1u)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.MIISEL */
#define IFX_ETH_HW_FEATURE_MIISEL_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.MIISEL */
#define IFX_ETH_HW_FEATURE_MIISEL_OFF (0u)

/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.MMCSEL */
#define IFX_ETH_HW_FEATURE_MMCSEL_LEN (1u)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.MMCSEL */
#define IFX_ETH_HW_FEATURE_MMCSEL_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.MMCSEL */
#define IFX_ETH_HW_FEATURE_MMCSEL_OFF (11u)

/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.PCSSEL */
#define IFX_ETH_HW_FEATURE_PCSSEL_LEN (1u)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.PCSSEL */
#define IFX_ETH_HW_FEATURE_PCSSEL_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.PCSSEL */
#define IFX_ETH_HW_FEATURE_PCSSEL_OFF (6u)

/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.RWKSEL */
#define IFX_ETH_HW_FEATURE_RWKSEL_LEN (1u)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.RWKSEL */
#define IFX_ETH_HW_FEATURE_RWKSEL_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.RWKSEL */
#define IFX_ETH_HW_FEATURE_RWKSEL_OFF (9u)

/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.RXCHCNT */
#define IFX_ETH_HW_FEATURE_RXCHCNT_LEN (2u)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.RXCHCNT */
#define IFX_ETH_HW_FEATURE_RXCHCNT_MSK (0x3u)

/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.RXCHCNT */
#define IFX_ETH_HW_FEATURE_RXCHCNT_OFF (20u)

/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.RXFIFOSIZE */
#define IFX_ETH_HW_FEATURE_RXFIFOSIZE_LEN (1u)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.RXFIFOSIZE */
#define IFX_ETH_HW_FEATURE_RXFIFOSIZE_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.RXFIFOSIZE */
#define IFX_ETH_HW_FEATURE_RXFIFOSIZE_OFF (19u)

/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.RXTYP1COE */
#define IFX_ETH_HW_FEATURE_RXTYP1COE_LEN (1u)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.RXTYP1COE */
#define IFX_ETH_HW_FEATURE_RXTYP1COE_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.RXTYP1COE */
#define IFX_ETH_HW_FEATURE_RXTYP1COE_OFF (17u)

/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.RXTYP2COE */
#define IFX_ETH_HW_FEATURE_RXTYP2COE_LEN (1u)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.RXTYP2COE */
#define IFX_ETH_HW_FEATURE_RXTYP2COE_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.RXTYP2COE */
#define IFX_ETH_HW_FEATURE_RXTYP2COE_OFF (18u)

/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.SAVLANINS */
#define IFX_ETH_HW_FEATURE_SAVLANINS_LEN (1u)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.SAVLANINS */
#define IFX_ETH_HW_FEATURE_SAVLANINS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.SAVLANINS */
#define IFX_ETH_HW_FEATURE_SAVLANINS_OFF (27u)

/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.SMASEL */
#define IFX_ETH_HW_FEATURE_SMASEL_LEN (1u)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.SMASEL */
#define IFX_ETH_HW_FEATURE_SMASEL_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.SMASEL */
#define IFX_ETH_HW_FEATURE_SMASEL_OFF (8u)

/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.TSVER1SEL */
#define IFX_ETH_HW_FEATURE_TSVER1SEL_LEN (1u)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.TSVER1SEL */
#define IFX_ETH_HW_FEATURE_TSVER1SEL_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.TSVER1SEL */
#define IFX_ETH_HW_FEATURE_TSVER1SEL_OFF (12u)

/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.TSVER2SEL */
#define IFX_ETH_HW_FEATURE_TSVER2SEL_LEN (1u)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.TSVER2SEL */
#define IFX_ETH_HW_FEATURE_TSVER2SEL_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.TSVER2SEL */
#define IFX_ETH_HW_FEATURE_TSVER2SEL_OFF (13u)

/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.TXCHCNT */
#define IFX_ETH_HW_FEATURE_TXCHCNT_LEN (2u)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.TXCHCNT */
#define IFX_ETH_HW_FEATURE_TXCHCNT_MSK (0x3u)

/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.TXCHCNT */
#define IFX_ETH_HW_FEATURE_TXCHCNT_OFF (22u)

/** \brief  Length for Ifx_ETH_HW_FEATURE_Bits.TXCOESEL */
#define IFX_ETH_HW_FEATURE_TXCOESEL_LEN (1u)

/** \brief  Mask for Ifx_ETH_HW_FEATURE_Bits.TXCOESEL */
#define IFX_ETH_HW_FEATURE_TXCOESEL_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_HW_FEATURE_Bits.TXCOESEL */
#define IFX_ETH_HW_FEATURE_TXCOESEL_OFF (16u)

/** \brief  Length for Ifx_ETH_ID_Bits.MODNUMBER */
#define IFX_ETH_ID_MODNUMBER_LEN (16u)

/** \brief  Mask for Ifx_ETH_ID_Bits.MODNUMBER */
#define IFX_ETH_ID_MODNUMBER_MSK (0xffffu)

/** \brief  Offset for Ifx_ETH_ID_Bits.MODNUMBER */
#define IFX_ETH_ID_MODNUMBER_OFF (16u)

/** \brief  Length for Ifx_ETH_ID_Bits.MODREV */
#define IFX_ETH_ID_MODREV_LEN (8u)

/** \brief  Mask for Ifx_ETH_ID_Bits.MODREV */
#define IFX_ETH_ID_MODREV_MSK (0xffu)

/** \brief  Offset for Ifx_ETH_ID_Bits.MODREV */
#define IFX_ETH_ID_MODREV_OFF (0u)

/** \brief  Length for Ifx_ETH_ID_Bits.MODTYPE */
#define IFX_ETH_ID_MODTYPE_LEN (8u)

/** \brief  Mask for Ifx_ETH_ID_Bits.MODTYPE */
#define IFX_ETH_ID_MODTYPE_MSK (0xffu)

/** \brief  Offset for Ifx_ETH_ID_Bits.MODTYPE */
#define IFX_ETH_ID_MODTYPE_OFF (8u)

/** \brief  Length for Ifx_ETH_INTERRUPT_ENABLE_Bits.AIE */
#define IFX_ETH_INTERRUPT_ENABLE_AIE_LEN (1u)

