xiongGithub1/autosarTc234/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC23X_AB_PB_BASE_V501_REL-334/TC23x_ABstep/Aurix_MC-ISAR/general/tricore/inc/TC23x/IfxEth_bf.h
/** \brief  Offset for Ifx_ETH_INTERRUPT_STATUS_Bits.LPIIS */
#define IFX_ETH_INTERRUPT_STATUS_LPIIS_OFF (10u)

/** \brief  Length for Ifx_ETH_INTERRUPT_STATUS_Bits.MMCIS */
#define IFX_ETH_INTERRUPT_STATUS_MMCIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_INTERRUPT_STATUS_Bits.MMCIS */
#define IFX_ETH_INTERRUPT_STATUS_MMCIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_INTERRUPT_STATUS_Bits.MMCIS */
#define IFX_ETH_INTERRUPT_STATUS_MMCIS_OFF (4u)

/** \brief  Length for Ifx_ETH_INTERRUPT_STATUS_Bits.MMCRXIPIS */
#define IFX_ETH_INTERRUPT_STATUS_MMCRXIPIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_INTERRUPT_STATUS_Bits.MMCRXIPIS */
#define IFX_ETH_INTERRUPT_STATUS_MMCRXIPIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_INTERRUPT_STATUS_Bits.MMCRXIPIS */
#define IFX_ETH_INTERRUPT_STATUS_MMCRXIPIS_OFF (7u)

/** \brief  Length for Ifx_ETH_INTERRUPT_STATUS_Bits.MMCRXIS */
#define IFX_ETH_INTERRUPT_STATUS_MMCRXIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_INTERRUPT_STATUS_Bits.MMCRXIS */
#define IFX_ETH_INTERRUPT_STATUS_MMCRXIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_INTERRUPT_STATUS_Bits.MMCRXIS */
#define IFX_ETH_INTERRUPT_STATUS_MMCRXIS_OFF (5u)

/** \brief  Length for Ifx_ETH_INTERRUPT_STATUS_Bits.MMCTXIS */
#define IFX_ETH_INTERRUPT_STATUS_MMCTXIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_INTERRUPT_STATUS_Bits.MMCTXIS */
#define IFX_ETH_INTERRUPT_STATUS_MMCTXIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_INTERRUPT_STATUS_Bits.MMCTXIS */
#define IFX_ETH_INTERRUPT_STATUS_MMCTXIS_OFF (6u)

/** \brief  Length for Ifx_ETH_INTERRUPT_STATUS_Bits.PCSANCIS */
#define IFX_ETH_INTERRUPT_STATUS_PCSANCIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_INTERRUPT_STATUS_Bits.PCSANCIS */
#define IFX_ETH_INTERRUPT_STATUS_PCSANCIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_INTERRUPT_STATUS_Bits.PCSANCIS */
#define IFX_ETH_INTERRUPT_STATUS_PCSANCIS_OFF (2u)

/** \brief  Length for Ifx_ETH_INTERRUPT_STATUS_Bits.PCSLCHGIS */
#define IFX_ETH_INTERRUPT_STATUS_PCSLCHGIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_INTERRUPT_STATUS_Bits.PCSLCHGIS */
#define IFX_ETH_INTERRUPT_STATUS_PCSLCHGIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_INTERRUPT_STATUS_Bits.PCSLCHGIS */
#define IFX_ETH_INTERRUPT_STATUS_PCSLCHGIS_OFF (1u)

/** \brief  Length for Ifx_ETH_INTERRUPT_STATUS_Bits.PMTIS */
#define IFX_ETH_INTERRUPT_STATUS_PMTIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_INTERRUPT_STATUS_Bits.PMTIS */
#define IFX_ETH_INTERRUPT_STATUS_PMTIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_INTERRUPT_STATUS_Bits.PMTIS */
#define IFX_ETH_INTERRUPT_STATUS_PMTIS_OFF (3u)

/** \brief  Length for Ifx_ETH_INTERRUPT_STATUS_Bits.RGSMIIIS */
#define IFX_ETH_INTERRUPT_STATUS_RGSMIIIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_INTERRUPT_STATUS_Bits.RGSMIIIS */
#define IFX_ETH_INTERRUPT_STATUS_RGSMIIIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_INTERRUPT_STATUS_Bits.RGSMIIIS */
#define IFX_ETH_INTERRUPT_STATUS_RGSMIIIS_OFF (0u)

/** \brief  Length for Ifx_ETH_INTERRUPT_STATUS_Bits.TSIS */
#define IFX_ETH_INTERRUPT_STATUS_TSIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_INTERRUPT_STATUS_Bits.TSIS */
#define IFX_ETH_INTERRUPT_STATUS_TSIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_INTERRUPT_STATUS_Bits.TSIS */
#define IFX_ETH_INTERRUPT_STATUS_TSIS_OFF (9u)

/** \brief  Length for Ifx_ETH_KRST0_Bits.RST */
#define IFX_ETH_KRST0_RST_LEN (1u)

/** \brief  Mask for Ifx_ETH_KRST0_Bits.RST */
#define IFX_ETH_KRST0_RST_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_KRST0_Bits.RST */
#define IFX_ETH_KRST0_RST_OFF (0u)

/** \brief  Length for Ifx_ETH_KRST0_Bits.RSTSTAT */
#define IFX_ETH_KRST0_RSTSTAT_LEN (1u)

/** \brief  Mask for Ifx_ETH_KRST0_Bits.RSTSTAT */
#define IFX_ETH_KRST0_RSTSTAT_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_KRST0_Bits.RSTSTAT */
#define IFX_ETH_KRST0_RSTSTAT_OFF (1u)

/** \brief  Length for Ifx_ETH_KRST1_Bits.RST */
#define IFX_ETH_KRST1_RST_LEN (1u)

/** \brief  Mask for Ifx_ETH_KRST1_Bits.RST */
#define IFX_ETH_KRST1_RST_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_KRST1_Bits.RST */
#define IFX_ETH_KRST1_RST_OFF (0u)

/** \brief  Length for Ifx_ETH_KRSTCLR_Bits.CLR */
#define IFX_ETH_KRSTCLR_CLR_LEN (1u)

/** \brief  Mask for Ifx_ETH_KRSTCLR_Bits.CLR */
#define IFX_ETH_KRSTCLR_CLR_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_KRSTCLR_Bits.CLR */
#define IFX_ETH_KRSTCLR_CLR_OFF (0u)

/** \brief  Length for Ifx_ETH_MAC_ADDRESS_HIGH_Bits.ADDRHI */
#define IFX_ETH_MAC_ADDRESS_HIGH_ADDRHI_LEN (16u)

/** \brief  Mask for Ifx_ETH_MAC_ADDRESS_HIGH_Bits.ADDRHI */
#define IFX_ETH_MAC_ADDRESS_HIGH_ADDRHI_MSK (0xffffu)

/** \brief  Offset for Ifx_ETH_MAC_ADDRESS_HIGH_Bits.ADDRHI */
#define IFX_ETH_MAC_ADDRESS_HIGH_ADDRHI_OFF (0u)

/** \brief  Length for Ifx_ETH_MAC_ADDRESS_HIGH_Bits.AE */
#define IFX_ETH_MAC_ADDRESS_HIGH_AE_LEN (1u)

/** \brief  Mask for Ifx_ETH_MAC_ADDRESS_HIGH_Bits.AE */
#define IFX_ETH_MAC_ADDRESS_HIGH_AE_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MAC_ADDRESS_HIGH_Bits.AE */
#define IFX_ETH_MAC_ADDRESS_HIGH_AE_OFF (31u)

/** \brief  Length for Ifx_ETH_MAC_ADDRESS_HIGH_Bits.MBC */
#define IFX_ETH_MAC_ADDRESS_HIGH_MBC_LEN (6u)

/** \brief  Mask for Ifx_ETH_MAC_ADDRESS_HIGH_Bits.MBC */
#define IFX_ETH_MAC_ADDRESS_HIGH_MBC_MSK (0x3fu)

/** \brief  Offset for Ifx_ETH_MAC_ADDRESS_HIGH_Bits.MBC */
#define IFX_ETH_MAC_ADDRESS_HIGH_MBC_OFF (24u)

/** \brief  Length for Ifx_ETH_MAC_ADDRESS_HIGH_Bits.SA */
#define IFX_ETH_MAC_ADDRESS_HIGH_SA_LEN (1u)

/** \brief  Mask for Ifx_ETH_MAC_ADDRESS_HIGH_Bits.SA */
#define IFX_ETH_MAC_ADDRESS_HIGH_SA_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MAC_ADDRESS_HIGH_Bits.SA */
#define IFX_ETH_MAC_ADDRESS_HIGH_SA_OFF (30u)

/** \brief  Length for Ifx_ETH_MAC_ADDRESS_LOW_Bits.ADDRLO */
#define IFX_ETH_MAC_ADDRESS_LOW_ADDRLO_LEN (32u)

/** \brief  Mask for Ifx_ETH_MAC_ADDRESS_LOW_Bits.ADDRLO */
#define IFX_ETH_MAC_ADDRESS_LOW_ADDRLO_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_MAC_ADDRESS_LOW_Bits.ADDRLO */
#define IFX_ETH_MAC_ADDRESS_LOW_ADDRLO_OFF (0u)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.ACS */
#define IFX_ETH_MAC_CONFIGURATION_ACS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.ACS */
#define IFX_ETH_MAC_CONFIGURATION_ACS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.ACS */
#define IFX_ETH_MAC_CONFIGURATION_ACS_OFF (7u)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.BE */
#define IFX_ETH_MAC_CONFIGURATION_BE_LEN (1u)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.BE */
#define IFX_ETH_MAC_CONFIGURATION_BE_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.BE */
#define IFX_ETH_MAC_CONFIGURATION_BE_OFF (21u)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.BL */
#define IFX_ETH_MAC_CONFIGURATION_BL_LEN (2u)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.BL */
#define IFX_ETH_MAC_CONFIGURATION_BL_MSK (0x3u)

