xiongGithub1/autosarTc234/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC23X_AB_PB_BASE_V501_REL-334/TC23x_ABstep/Aurix_MC-ISAR/general/tricore/inc/TC23x/IfxEth_bf.h
/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.BL */
#define IFX_ETH_MAC_CONFIGURATION_BL_OFF (5u)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.CST */
#define IFX_ETH_MAC_CONFIGURATION_CST_LEN (1u)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.CST */
#define IFX_ETH_MAC_CONFIGURATION_CST_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.CST */
#define IFX_ETH_MAC_CONFIGURATION_CST_OFF (25u)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.DC */
#define IFX_ETH_MAC_CONFIGURATION_DC_LEN (1u)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.DC */
#define IFX_ETH_MAC_CONFIGURATION_DC_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.DC */
#define IFX_ETH_MAC_CONFIGURATION_DC_OFF (4u)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.DCRS */
#define IFX_ETH_MAC_CONFIGURATION_DCRS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.DCRS */
#define IFX_ETH_MAC_CONFIGURATION_DCRS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.DCRS */
#define IFX_ETH_MAC_CONFIGURATION_DCRS_OFF (16u)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.DM */
#define IFX_ETH_MAC_CONFIGURATION_DM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.DM */
#define IFX_ETH_MAC_CONFIGURATION_DM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.DM */
#define IFX_ETH_MAC_CONFIGURATION_DM_OFF (11u)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.DO */
#define IFX_ETH_MAC_CONFIGURATION_DO_LEN (1u)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.DO */
#define IFX_ETH_MAC_CONFIGURATION_DO_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.DO */
#define IFX_ETH_MAC_CONFIGURATION_DO_OFF (13u)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.DR */
#define IFX_ETH_MAC_CONFIGURATION_DR_LEN (1u)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.DR */
#define IFX_ETH_MAC_CONFIGURATION_DR_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.DR */
#define IFX_ETH_MAC_CONFIGURATION_DR_OFF (9u)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.FES */
#define IFX_ETH_MAC_CONFIGURATION_FES_LEN (1u)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.FES */
#define IFX_ETH_MAC_CONFIGURATION_FES_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.FES */
#define IFX_ETH_MAC_CONFIGURATION_FES_OFF (14u)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.IFG */
#define IFX_ETH_MAC_CONFIGURATION_IFG_LEN (3u)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.IFG */
#define IFX_ETH_MAC_CONFIGURATION_IFG_MSK (0x7u)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.IFG */
#define IFX_ETH_MAC_CONFIGURATION_IFG_OFF (17u)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.IPC */
#define IFX_ETH_MAC_CONFIGURATION_IPC_LEN (1u)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.IPC */
#define IFX_ETH_MAC_CONFIGURATION_IPC_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.IPC */
#define IFX_ETH_MAC_CONFIGURATION_IPC_OFF (10u)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.JD */
#define IFX_ETH_MAC_CONFIGURATION_JD_LEN (1u)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.JD */
#define IFX_ETH_MAC_CONFIGURATION_JD_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.JD */
#define IFX_ETH_MAC_CONFIGURATION_JD_OFF (22u)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.JE */
#define IFX_ETH_MAC_CONFIGURATION_JE_LEN (1u)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.JE */
#define IFX_ETH_MAC_CONFIGURATION_JE_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.JE */
#define IFX_ETH_MAC_CONFIGURATION_JE_OFF (20u)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.LM */
#define IFX_ETH_MAC_CONFIGURATION_LM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.LM */
#define IFX_ETH_MAC_CONFIGURATION_LM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.LM */
#define IFX_ETH_MAC_CONFIGURATION_LM_OFF (12u)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.LUD */
#define IFX_ETH_MAC_CONFIGURATION_LUD_LEN (1u)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.LUD */
#define IFX_ETH_MAC_CONFIGURATION_LUD_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.LUD */
#define IFX_ETH_MAC_CONFIGURATION_LUD_OFF (8u)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.PRELEN */
#define IFX_ETH_MAC_CONFIGURATION_PRELEN_LEN (2u)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.PRELEN */
#define IFX_ETH_MAC_CONFIGURATION_PRELEN_MSK (0x3u)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.PRELEN */
#define IFX_ETH_MAC_CONFIGURATION_PRELEN_OFF (0u)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.PS */
#define IFX_ETH_MAC_CONFIGURATION_PS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.PS */
#define IFX_ETH_MAC_CONFIGURATION_PS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.PS */
#define IFX_ETH_MAC_CONFIGURATION_PS_OFF (15u)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.RE */
#define IFX_ETH_MAC_CONFIGURATION_RE_LEN (1u)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.RE */
#define IFX_ETH_MAC_CONFIGURATION_RE_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.RE */
#define IFX_ETH_MAC_CONFIGURATION_RE_OFF (2u)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.SARC */
#define IFX_ETH_MAC_CONFIGURATION_SARC_LEN (3u)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.SARC */
#define IFX_ETH_MAC_CONFIGURATION_SARC_MSK (0x7u)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.SARC */
#define IFX_ETH_MAC_CONFIGURATION_SARC_OFF (28u)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.SFTERR */
#define IFX_ETH_MAC_CONFIGURATION_SFTERR_LEN (1u)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.SFTERR */
#define IFX_ETH_MAC_CONFIGURATION_SFTERR_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MAC_CONFIGURATION_Bits.SFTERR */
#define IFX_ETH_MAC_CONFIGURATION_SFTERR_OFF (26u)

/** \brief  Length for Ifx_ETH_MAC_CONFIGURATION_Bits.TC */
#define IFX_ETH_MAC_CONFIGURATION_TC_LEN (1u)

/** \brief  Mask for Ifx_ETH_MAC_CONFIGURATION_Bits.TC */
#define IFX_ETH_MAC_CONFIGURATION_TC_MSK (0x1u)

