xiongGithub1/autosarTc234/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC23X_AB_PB_BASE_V501_REL-334/TC23x_ABstep/Aurix_MC-ISAR/general/tricore/inc/TC23x/IfxEth_bf.h
/** \brief  Length for
 * Ifx_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_Bits.MISFRMCNT */
#define IFX_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_MISFRMCNT_LEN (16u)

/** \brief  Mask for
 * Ifx_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_Bits.MISFRMCNT */
#define IFX_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_MISFRMCNT_MSK (0xffffu)

/** \brief  Offset for
 * Ifx_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_Bits.MISFRMCNT */
#define IFX_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_MISFRMCNT_OFF (0u)

/** \brief  Length for
 * Ifx_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_Bits.OVFCNTOVF */
#define IFX_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_OVFCNTOVF_LEN (1u)

/** \brief  Mask for
 * Ifx_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_Bits.OVFCNTOVF */
#define IFX_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_OVFCNTOVF_MSK (0x1u)

/** \brief  Offset for
 * Ifx_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_Bits.OVFCNTOVF */
#define IFX_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_OVFCNTOVF_OFF (28u)

/** \brief  Length for
 * Ifx_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_Bits.OVFFRMCNT */
#define IFX_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_OVFFRMCNT_LEN (11u)

/** \brief  Mask for
 * Ifx_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_Bits.OVFFRMCNT */
#define IFX_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_OVFFRMCNT_MSK (0x7ffu)

/** \brief  Offset for
 * Ifx_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_Bits.OVFFRMCNT */
#define IFX_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER_OVFFRMCNT_OFF (17u)

/** \brief  Length for Ifx_ETH_MMC_CONTROL_Bits.CNTFREEZ */
#define IFX_ETH_MMC_CONTROL_CNTFREEZ_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_CONTROL_Bits.CNTFREEZ */
#define IFX_ETH_MMC_CONTROL_CNTFREEZ_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_CONTROL_Bits.CNTFREEZ */
#define IFX_ETH_MMC_CONTROL_CNTFREEZ_OFF (3u)

/** \brief  Length for Ifx_ETH_MMC_CONTROL_Bits.CNTPRST */
#define IFX_ETH_MMC_CONTROL_CNTPRST_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_CONTROL_Bits.CNTPRST */
#define IFX_ETH_MMC_CONTROL_CNTPRST_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_CONTROL_Bits.CNTPRST */
#define IFX_ETH_MMC_CONTROL_CNTPRST_OFF (4u)

/** \brief  Length for Ifx_ETH_MMC_CONTROL_Bits.CNTPRSTLVL */
#define IFX_ETH_MMC_CONTROL_CNTPRSTLVL_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_CONTROL_Bits.CNTPRSTLVL */
#define IFX_ETH_MMC_CONTROL_CNTPRSTLVL_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_CONTROL_Bits.CNTPRSTLVL */
#define IFX_ETH_MMC_CONTROL_CNTPRSTLVL_OFF (5u)

/** \brief  Length for Ifx_ETH_MMC_CONTROL_Bits.CNTRST */
#define IFX_ETH_MMC_CONTROL_CNTRST_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_CONTROL_Bits.CNTRST */
#define IFX_ETH_MMC_CONTROL_CNTRST_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_CONTROL_Bits.CNTRST */
#define IFX_ETH_MMC_CONTROL_CNTRST_OFF (0u)

/** \brief  Length for Ifx_ETH_MMC_CONTROL_Bits.CNTSTOPRO */
#define IFX_ETH_MMC_CONTROL_CNTSTOPRO_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_CONTROL_Bits.CNTSTOPRO */
#define IFX_ETH_MMC_CONTROL_CNTSTOPRO_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_CONTROL_Bits.CNTSTOPRO */
#define IFX_ETH_MMC_CONTROL_CNTSTOPRO_OFF (1u)

/** \brief  Length for Ifx_ETH_MMC_CONTROL_Bits.RSTONRD */
#define IFX_ETH_MMC_CONTROL_RSTONRD_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_CONTROL_Bits.RSTONRD */
#define IFX_ETH_MMC_CONTROL_RSTONRD_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_CONTROL_Bits.RSTONRD */
#define IFX_ETH_MMC_CONTROL_RSTONRD_OFF (2u)

/** \brief  Length for Ifx_ETH_MMC_CONTROL_Bits.UCDBC */
#define IFX_ETH_MMC_CONTROL_UCDBC_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_CONTROL_Bits.UCDBC */
#define IFX_ETH_MMC_CONTROL_UCDBC_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_CONTROL_Bits.UCDBC */
#define IFX_ETH_MMC_CONTROL_UCDBC_OFF (8u)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXICMPERFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXICMPERFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXICMPERFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXICMPERFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXICMPERFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXICMPERFIM_OFF (13u)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXICMPEROIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXICMPEROIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXICMPEROIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXICMPEROIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXICMPEROIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXICMPEROIM_OFF (29u)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXICMPGFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXICMPGFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXICMPGFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXICMPGFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXICMPGFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXICMPGFIM_OFF (12u)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXICMPGOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXICMPGOIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXICMPGOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXICMPGOIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXICMPGOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXICMPGOIM_OFF (28u)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV4FRAGFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV4FRAGFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV4FRAGFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV4FRAGFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV4FRAGFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV4FRAGFIM_OFF (3u)

