xiongGithub1/autosarTc234/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC23X_AB_PB_BASE_V501_REL-334/TC23x_ABstep/Aurix_MC-ISAR/general/tricore/inc/TC23x/IfxEth_bf.h
/** \brief  Length for
 * Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV6NOPAYFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV6NOPAYFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV6NOPAYFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV6NOPAYFIM_MSK (0x1u)

/** \brief  Offset for
 * Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV6NOPAYFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV6NOPAYFIM_OFF (7u)

/** \brief  Length for
 * Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV6NOPAYOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV6NOPAYOIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV6NOPAYOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV6NOPAYOIM_MSK (0x1u)

/** \brief  Offset for
 * Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXIPV6NOPAYOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXIPV6NOPAYOIM_OFF (23u)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXTCPERFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXTCPERFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXTCPERFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXTCPERFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXTCPERFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXTCPERFIM_OFF (11u)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXTCPEROIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXTCPEROIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXTCPEROIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXTCPEROIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXTCPEROIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXTCPEROIM_OFF (27u)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXTCPGFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXTCPGFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXTCPGFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXTCPGFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXTCPGFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXTCPGFIM_OFF (10u)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXTCPGOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXTCPGOIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXTCPGOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXTCPGOIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXTCPGOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXTCPGOIM_OFF (26u)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXUDPERFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXUDPERFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXUDPERFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXUDPERFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXUDPERFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXUDPERFIM_OFF (9u)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXUDPEROIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXUDPEROIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXUDPEROIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXUDPEROIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXUDPEROIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXUDPEROIM_OFF (25u)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXUDPGFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXUDPGFIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXUDPGFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXUDPGFIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXUDPGFIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXUDPGFIM_OFF (8u)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXUDPGOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXUDPGOIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXUDPGOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXUDPGOIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_Bits.RXUDPGOIM */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK_RXUDPGOIM_OFF (24u)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXICMPERFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXICMPERFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXICMPERFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXICMPERFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXICMPERFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXICMPERFIS_OFF (13u)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXICMPEROIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXICMPEROIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXICMPEROIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXICMPEROIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXICMPEROIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXICMPEROIS_OFF (29u)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXICMPGFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXICMPGFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXICMPGFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXICMPGFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXICMPGFIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXICMPGFIS_OFF (12u)

/** \brief  Length for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXICMPGOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXICMPGOIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXICMPGOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXICMPGOIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_Bits.RXICMPGOIS */
#define IFX_ETH_MMC_IPC_RECEIVE_INTERRUPT_RXICMPGOIS_OFF (28u)

