xiongGithub1/autosarTc234/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC23X_AB_PB_BASE_V501_REL-334/TC23x_ABstep/Aurix_MC-ISAR/general/tricore/inc/TC23x/IfxEth_bf.h
/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXUCGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXUCGBFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXUCGBFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXUCGBFIS_OFF (10u)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXUFLOWERFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXUFLOWERFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXUFLOWERFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXUFLOWERFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXUFLOWERFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXUFLOWERFIS_OFF (13u)

/** \brief  Length for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXVLANGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXVLANGFIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXVLANGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXVLANGFIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_MMC_TRANSMIT_INTERRUPT_Bits.TXVLANGFIS */
#define IFX_ETH_MMC_TRANSMIT_INTERRUPT_TXVLANGFIS_OFF (24u)

/** \brief  Length for Ifx_ETH_OPERATION_MODE_Bits.DFF */
#define IFX_ETH_OPERATION_MODE_DFF_LEN (1u)

/** \brief  Mask for Ifx_ETH_OPERATION_MODE_Bits.DFF */
#define IFX_ETH_OPERATION_MODE_DFF_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_OPERATION_MODE_Bits.DFF */
#define IFX_ETH_OPERATION_MODE_DFF_OFF (24u)

/** \brief  Length for Ifx_ETH_OPERATION_MODE_Bits.DT */
#define IFX_ETH_OPERATION_MODE_DT_LEN (1u)

/** \brief  Mask for Ifx_ETH_OPERATION_MODE_Bits.DT */
#define IFX_ETH_OPERATION_MODE_DT_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_OPERATION_MODE_Bits.DT */
#define IFX_ETH_OPERATION_MODE_DT_OFF (26u)

/** \brief  Length for Ifx_ETH_OPERATION_MODE_Bits.EFC */
#define IFX_ETH_OPERATION_MODE_EFC_LEN (1u)

/** \brief  Mask for Ifx_ETH_OPERATION_MODE_Bits.EFC */
#define IFX_ETH_OPERATION_MODE_EFC_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_OPERATION_MODE_Bits.EFC */
#define IFX_ETH_OPERATION_MODE_EFC_OFF (8u)

/** \brief  Length for Ifx_ETH_OPERATION_MODE_Bits.FEF */
#define IFX_ETH_OPERATION_MODE_FEF_LEN (1u)

/** \brief  Mask for Ifx_ETH_OPERATION_MODE_Bits.FEF */
#define IFX_ETH_OPERATION_MODE_FEF_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_OPERATION_MODE_Bits.FEF */
#define IFX_ETH_OPERATION_MODE_FEF_OFF (7u)

/** \brief  Length for Ifx_ETH_OPERATION_MODE_Bits.FTF */
#define IFX_ETH_OPERATION_MODE_FTF_LEN (1u)

/** \brief  Mask for Ifx_ETH_OPERATION_MODE_Bits.FTF */
#define IFX_ETH_OPERATION_MODE_FTF_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_OPERATION_MODE_Bits.FTF */
#define IFX_ETH_OPERATION_MODE_FTF_OFF (20u)

/** \brief  Length for Ifx_ETH_OPERATION_MODE_Bits.FUF */
#define IFX_ETH_OPERATION_MODE_FUF_LEN (1u)

/** \brief  Mask for Ifx_ETH_OPERATION_MODE_Bits.FUF */
#define IFX_ETH_OPERATION_MODE_FUF_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_OPERATION_MODE_Bits.FUF */
#define IFX_ETH_OPERATION_MODE_FUF_OFF (6u)

/** \brief  Length for Ifx_ETH_OPERATION_MODE_Bits.OSF */
#define IFX_ETH_OPERATION_MODE_OSF_LEN (1u)

/** \brief  Mask for Ifx_ETH_OPERATION_MODE_Bits.OSF */
#define IFX_ETH_OPERATION_MODE_OSF_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_OPERATION_MODE_Bits.OSF */
#define IFX_ETH_OPERATION_MODE_OSF_OFF (2u)

/** \brief  Length for Ifx_ETH_OPERATION_MODE_Bits.RFA_2 */
#define IFX_ETH_OPERATION_MODE_RFA_2_LEN (1u)

/** \brief  Mask for Ifx_ETH_OPERATION_MODE_Bits.RFA_2 */
#define IFX_ETH_OPERATION_MODE_RFA_2_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_OPERATION_MODE_Bits.RFA_2 */
#define IFX_ETH_OPERATION_MODE_RFA_2_OFF (23u)

/** \brief  Length for Ifx_ETH_OPERATION_MODE_Bits.RFA */
#define IFX_ETH_OPERATION_MODE_RFA_LEN (2u)

/** \brief  Mask for Ifx_ETH_OPERATION_MODE_Bits.RFA */
#define IFX_ETH_OPERATION_MODE_RFA_MSK (0x3u)

/** \brief  Offset for Ifx_ETH_OPERATION_MODE_Bits.RFA */
#define IFX_ETH_OPERATION_MODE_RFA_OFF (9u)

/** \brief  Length for Ifx_ETH_OPERATION_MODE_Bits.RFD_2 */
#define IFX_ETH_OPERATION_MODE_RFD_2_LEN (1u)

/** \brief  Mask for Ifx_ETH_OPERATION_MODE_Bits.RFD_2 */
#define IFX_ETH_OPERATION_MODE_RFD_2_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_OPERATION_MODE_Bits.RFD_2 */
#define IFX_ETH_OPERATION_MODE_RFD_2_OFF (22u)

/** \brief  Length for Ifx_ETH_OPERATION_MODE_Bits.RFD */
#define IFX_ETH_OPERATION_MODE_RFD_LEN (2u)

/** \brief  Mask for Ifx_ETH_OPERATION_MODE_Bits.RFD */
#define IFX_ETH_OPERATION_MODE_RFD_MSK (0x3u)

/** \brief  Offset for Ifx_ETH_OPERATION_MODE_Bits.RFD */
#define IFX_ETH_OPERATION_MODE_RFD_OFF (11u)

/** \brief  Length for Ifx_ETH_OPERATION_MODE_Bits.RSF */
#define IFX_ETH_OPERATION_MODE_RSF_LEN (1u)

/** \brief  Mask for Ifx_ETH_OPERATION_MODE_Bits.RSF */
#define IFX_ETH_OPERATION_MODE_RSF_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_OPERATION_MODE_Bits.RSF */
#define IFX_ETH_OPERATION_MODE_RSF_OFF (25u)

/** \brief  Length for Ifx_ETH_OPERATION_MODE_Bits.RTC */
#define IFX_ETH_OPERATION_MODE_RTC_LEN (2u)

/** \brief  Mask for Ifx_ETH_OPERATION_MODE_Bits.RTC */
#define IFX_ETH_OPERATION_MODE_RTC_MSK (0x3u)

/** \brief  Offset for Ifx_ETH_OPERATION_MODE_Bits.RTC */
#define IFX_ETH_OPERATION_MODE_RTC_OFF (3u)

/** \brief  Length for Ifx_ETH_OPERATION_MODE_Bits.SR */
#define IFX_ETH_OPERATION_MODE_SR_LEN (1u)

/** \brief  Mask for Ifx_ETH_OPERATION_MODE_Bits.SR */
#define IFX_ETH_OPERATION_MODE_SR_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_OPERATION_MODE_Bits.SR */
#define IFX_ETH_OPERATION_MODE_SR_OFF (1u)

/** \brief  Length for Ifx_ETH_OPERATION_MODE_Bits.ST */
#define IFX_ETH_OPERATION_MODE_ST_LEN (1u)

/** \brief  Mask for Ifx_ETH_OPERATION_MODE_Bits.ST */
#define IFX_ETH_OPERATION_MODE_ST_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_OPERATION_MODE_Bits.ST */
#define IFX_ETH_OPERATION_MODE_ST_OFF (13u)

/** \brief  Length for Ifx_ETH_OPERATION_MODE_Bits.TSF */
#define IFX_ETH_OPERATION_MODE_TSF_LEN (1u)

/** \brief  Mask for Ifx_ETH_OPERATION_MODE_Bits.TSF */
#define IFX_ETH_OPERATION_MODE_TSF_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_OPERATION_MODE_Bits.TSF */
#define IFX_ETH_OPERATION_MODE_TSF_OFF (21u)

/** \brief  Length for Ifx_ETH_OPERATION_MODE_Bits.TTC */
#define IFX_ETH_OPERATION_MODE_TTC_LEN (3u)

