xiongGithub1/autosarTc234/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC23X_AB_PB_BASE_V501_REL-334/TC23x_ABstep/Aurix_MC-ISAR/general/tricore/inc/TC23x/IfxEth_bf.h
/** \brief  Mask for Ifx_ETH_OPERATION_MODE_Bits.TTC */
#define IFX_ETH_OPERATION_MODE_TTC_MSK (0x7u)

/** \brief  Offset for Ifx_ETH_OPERATION_MODE_Bits.TTC */
#define IFX_ETH_OPERATION_MODE_TTC_OFF (14u)

/** \brief  Length for Ifx_ETH_PMT_CONTROL_STATUS_Bits.GLBLUCAST */
#define IFX_ETH_PMT_CONTROL_STATUS_GLBLUCAST_LEN (1u)

/** \brief  Mask for Ifx_ETH_PMT_CONTROL_STATUS_Bits.GLBLUCAST */
#define IFX_ETH_PMT_CONTROL_STATUS_GLBLUCAST_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_PMT_CONTROL_STATUS_Bits.GLBLUCAST */
#define IFX_ETH_PMT_CONTROL_STATUS_GLBLUCAST_OFF (9u)

/** \brief  Length for Ifx_ETH_PMT_CONTROL_STATUS_Bits.MGKPKTEN */
#define IFX_ETH_PMT_CONTROL_STATUS_MGKPKTEN_LEN (1u)

/** \brief  Mask for Ifx_ETH_PMT_CONTROL_STATUS_Bits.MGKPKTEN */
#define IFX_ETH_PMT_CONTROL_STATUS_MGKPKTEN_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_PMT_CONTROL_STATUS_Bits.MGKPKTEN */
#define IFX_ETH_PMT_CONTROL_STATUS_MGKPKTEN_OFF (1u)

/** \brief  Length for Ifx_ETH_PMT_CONTROL_STATUS_Bits.MGKPRCVD */
#define IFX_ETH_PMT_CONTROL_STATUS_MGKPRCVD_LEN (1u)

/** \brief  Mask for Ifx_ETH_PMT_CONTROL_STATUS_Bits.MGKPRCVD */
#define IFX_ETH_PMT_CONTROL_STATUS_MGKPRCVD_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_PMT_CONTROL_STATUS_Bits.MGKPRCVD */
#define IFX_ETH_PMT_CONTROL_STATUS_MGKPRCVD_OFF (5u)

/** \brief  Length for Ifx_ETH_PMT_CONTROL_STATUS_Bits.PWRDWN */
#define IFX_ETH_PMT_CONTROL_STATUS_PWRDWN_LEN (1u)

/** \brief  Mask for Ifx_ETH_PMT_CONTROL_STATUS_Bits.PWRDWN */
#define IFX_ETH_PMT_CONTROL_STATUS_PWRDWN_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_PMT_CONTROL_STATUS_Bits.PWRDWN */
#define IFX_ETH_PMT_CONTROL_STATUS_PWRDWN_OFF (0u)

/** \brief  Length for Ifx_ETH_PMT_CONTROL_STATUS_Bits.RWKFILTRST */
#define IFX_ETH_PMT_CONTROL_STATUS_RWKFILTRST_LEN (1u)

/** \brief  Mask for Ifx_ETH_PMT_CONTROL_STATUS_Bits.RWKFILTRST */
#define IFX_ETH_PMT_CONTROL_STATUS_RWKFILTRST_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_PMT_CONTROL_STATUS_Bits.RWKFILTRST */
#define IFX_ETH_PMT_CONTROL_STATUS_RWKFILTRST_OFF (31u)

/** \brief  Length for Ifx_ETH_PMT_CONTROL_STATUS_Bits.RWKPKTEN */
#define IFX_ETH_PMT_CONTROL_STATUS_RWKPKTEN_LEN (1u)

/** \brief  Mask for Ifx_ETH_PMT_CONTROL_STATUS_Bits.RWKPKTEN */
#define IFX_ETH_PMT_CONTROL_STATUS_RWKPKTEN_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_PMT_CONTROL_STATUS_Bits.RWKPKTEN */
#define IFX_ETH_PMT_CONTROL_STATUS_RWKPKTEN_OFF (2u)

/** \brief  Length for Ifx_ETH_PMT_CONTROL_STATUS_Bits.RWKPRCVD */
#define IFX_ETH_PMT_CONTROL_STATUS_RWKPRCVD_LEN (1u)

/** \brief  Mask for Ifx_ETH_PMT_CONTROL_STATUS_Bits.RWKPRCVD */
#define IFX_ETH_PMT_CONTROL_STATUS_RWKPRCVD_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_PMT_CONTROL_STATUS_Bits.RWKPRCVD */
#define IFX_ETH_PMT_CONTROL_STATUS_RWKPRCVD_OFF (6u)

/** \brief  Length for Ifx_ETH_PPS_CONTROL_Bits.PPSCMD1 */
#define IFX_ETH_PPS_CONTROL_PPSCMD1_LEN (3u)

/** \brief  Mask for Ifx_ETH_PPS_CONTROL_Bits.PPSCMD1 */
#define IFX_ETH_PPS_CONTROL_PPSCMD1_MSK (0x7u)

/** \brief  Offset for Ifx_ETH_PPS_CONTROL_Bits.PPSCMD1 */
#define IFX_ETH_PPS_CONTROL_PPSCMD1_OFF (8u)

/** \brief  Length for Ifx_ETH_PPS_CONTROL_Bits.PPSCMD2 */
#define IFX_ETH_PPS_CONTROL_PPSCMD2_LEN (3u)

/** \brief  Mask for Ifx_ETH_PPS_CONTROL_Bits.PPSCMD2 */
#define IFX_ETH_PPS_CONTROL_PPSCMD2_MSK (0x7u)

/** \brief  Offset for Ifx_ETH_PPS_CONTROL_Bits.PPSCMD2 */
#define IFX_ETH_PPS_CONTROL_PPSCMD2_OFF (16u)

/** \brief  Length for Ifx_ETH_PPS_CONTROL_Bits.PPSCMD3 */
#define IFX_ETH_PPS_CONTROL_PPSCMD3_LEN (3u)

/** \brief  Mask for Ifx_ETH_PPS_CONTROL_Bits.PPSCMD3 */
#define IFX_ETH_PPS_CONTROL_PPSCMD3_MSK (0x7u)

/** \brief  Offset for Ifx_ETH_PPS_CONTROL_Bits.PPSCMD3 */
#define IFX_ETH_PPS_CONTROL_PPSCMD3_OFF (24u)

/** \brief  Length for Ifx_ETH_PPS_CONTROL_Bits.PPSCTRL_PPSCMD */
#define IFX_ETH_PPS_CONTROL_PPSCTRL_PPSCMD_LEN (4u)

/** \brief  Mask for Ifx_ETH_PPS_CONTROL_Bits.PPSCTRL_PPSCMD */
#define IFX_ETH_PPS_CONTROL_PPSCTRL_PPSCMD_MSK (0xfu)

/** \brief  Offset for Ifx_ETH_PPS_CONTROL_Bits.PPSCTRL_PPSCMD */
#define IFX_ETH_PPS_CONTROL_PPSCTRL_PPSCMD_OFF (0u)

/** \brief  Length for Ifx_ETH_PPS_CONTROL_Bits.PPSEN0 */
#define IFX_ETH_PPS_CONTROL_PPSEN0_LEN (1u)

/** \brief  Mask for Ifx_ETH_PPS_CONTROL_Bits.PPSEN0 */
#define IFX_ETH_PPS_CONTROL_PPSEN0_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_PPS_CONTROL_Bits.PPSEN0 */
#define IFX_ETH_PPS_CONTROL_PPSEN0_OFF (4u)

/** \brief  Length for Ifx_ETH_PPS_CONTROL_Bits.TRGTMODSEL0 */
#define IFX_ETH_PPS_CONTROL_TRGTMODSEL0_LEN (2u)

/** \brief  Mask for Ifx_ETH_PPS_CONTROL_Bits.TRGTMODSEL0 */
#define IFX_ETH_PPS_CONTROL_TRGTMODSEL0_MSK (0x3u)

/** \brief  Offset for Ifx_ETH_PPS_CONTROL_Bits.TRGTMODSEL0 */
#define IFX_ETH_PPS_CONTROL_TRGTMODSEL0_OFF (5u)

/** \brief  Length for Ifx_ETH_PPS_CONTROL_Bits.TRGTMODSEL1 */
#define IFX_ETH_PPS_CONTROL_TRGTMODSEL1_LEN (2u)

/** \brief  Mask for Ifx_ETH_PPS_CONTROL_Bits.TRGTMODSEL1 */
#define IFX_ETH_PPS_CONTROL_TRGTMODSEL1_MSK (0x3u)

/** \brief  Offset for Ifx_ETH_PPS_CONTROL_Bits.TRGTMODSEL1 */
#define IFX_ETH_PPS_CONTROL_TRGTMODSEL1_OFF (13u)

/** \brief  Length for Ifx_ETH_PPS_CONTROL_Bits.TRGTMODSEL2 */
#define IFX_ETH_PPS_CONTROL_TRGTMODSEL2_LEN (2u)

/** \brief  Mask for Ifx_ETH_PPS_CONTROL_Bits.TRGTMODSEL2 */
#define IFX_ETH_PPS_CONTROL_TRGTMODSEL2_MSK (0x3u)

/** \brief  Offset for Ifx_ETH_PPS_CONTROL_Bits.TRGTMODSEL2 */
#define IFX_ETH_PPS_CONTROL_TRGTMODSEL2_OFF (21u)

/** \brief  Length for Ifx_ETH_PPS_CONTROL_Bits.TRGTMODSEL3 */
#define IFX_ETH_PPS_CONTROL_TRGTMODSEL3_LEN (2u)

/** \brief  Mask for Ifx_ETH_PPS_CONTROL_Bits.TRGTMODSEL3 */
#define IFX_ETH_PPS_CONTROL_TRGTMODSEL3_MSK (0x3u)

/** \brief  Offset for Ifx_ETH_PPS_CONTROL_Bits.TRGTMODSEL3 */
#define IFX_ETH_PPS_CONTROL_TRGTMODSEL3_OFF (29u)

/** \brief  Length for Ifx_ETH_RECEIVE_DESCRIPTOR_LIST_ADDRESS_Bits.RDESLA */
#define IFX_ETH_RECEIVE_DESCRIPTOR_LIST_ADDRESS_RDESLA_LEN (30u)

/** \brief  Mask for Ifx_ETH_RECEIVE_DESCRIPTOR_LIST_ADDRESS_Bits.RDESLA */
#define IFX_ETH_RECEIVE_DESCRIPTOR_LIST_ADDRESS_RDESLA_MSK (0x3fffffffu)

/** \brief  Offset for Ifx_ETH_RECEIVE_DESCRIPTOR_LIST_ADDRESS_Bits.RDESLA */
#define IFX_ETH_RECEIVE_DESCRIPTOR_LIST_ADDRESS_RDESLA_OFF (2u)

/** \brief  Length for Ifx_ETH_RECEIVE_INTERRUPT_WATCHDOG_TIMER_Bits.RIWT */
#define IFX_ETH_RECEIVE_INTERRUPT_WATCHDOG_TIMER_RIWT_LEN (8u)

