xiongGithub1/autosarTc234/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC23X_AB_PB_BASE_V501_REL-334/TC23x_ABstep/Aurix_MC-ISAR/general/tricore/inc/TC23x/IfxEth_bf.h
/** \brief  Length for Ifx_ETH_RXICMP_GOOD_FRAMES_Bits.RXICMPGDFRM */
#define IFX_ETH_RXICMP_GOOD_FRAMES_RXICMPGDFRM_LEN (32u)

/** \brief  Mask for Ifx_ETH_RXICMP_GOOD_FRAMES_Bits.RXICMPGDFRM */
#define IFX_ETH_RXICMP_GOOD_FRAMES_RXICMPGDFRM_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_RXICMP_GOOD_FRAMES_Bits.RXICMPGDFRM */
#define IFX_ETH_RXICMP_GOOD_FRAMES_RXICMPGDFRM_OFF (0u)

/** \brief  Length for Ifx_ETH_RXICMP_GOOD_OCTETS_Bits.RXICMPGDOCT */
#define IFX_ETH_RXICMP_GOOD_OCTETS_RXICMPGDOCT_LEN (32u)

/** \brief  Mask for Ifx_ETH_RXICMP_GOOD_OCTETS_Bits.RXICMPGDOCT */
#define IFX_ETH_RXICMP_GOOD_OCTETS_RXICMPGDOCT_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_RXICMP_GOOD_OCTETS_Bits.RXICMPGDOCT */
#define IFX_ETH_RXICMP_GOOD_OCTETS_RXICMPGDOCT_OFF (0u)

/** \brief  Length for Ifx_ETH_RXIPV4_FRAGMENTED_FRAMES_Bits.RXIPV4FRAGFRM */
#define IFX_ETH_RXIPV4_FRAGMENTED_FRAMES_RXIPV4FRAGFRM_LEN (32u)

/** \brief  Mask for Ifx_ETH_RXIPV4_FRAGMENTED_FRAMES_Bits.RXIPV4FRAGFRM */
#define IFX_ETH_RXIPV4_FRAGMENTED_FRAMES_RXIPV4FRAGFRM_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_RXIPV4_FRAGMENTED_FRAMES_Bits.RXIPV4FRAGFRM */
#define IFX_ETH_RXIPV4_FRAGMENTED_FRAMES_RXIPV4FRAGFRM_OFF (0u)

/** \brief  Length for Ifx_ETH_RXIPV4_FRAGMENTED_OCTETS_Bits.RXIPV4FRAGOCT */
#define IFX_ETH_RXIPV4_FRAGMENTED_OCTETS_RXIPV4FRAGOCT_LEN (32u)

/** \brief  Mask for Ifx_ETH_RXIPV4_FRAGMENTED_OCTETS_Bits.RXIPV4FRAGOCT */
#define IFX_ETH_RXIPV4_FRAGMENTED_OCTETS_RXIPV4FRAGOCT_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_RXIPV4_FRAGMENTED_OCTETS_Bits.RXIPV4FRAGOCT */
#define IFX_ETH_RXIPV4_FRAGMENTED_OCTETS_RXIPV4FRAGOCT_OFF (0u)

/** \brief  Length for Ifx_ETH_RXIPV4_GOOD_FRAMES_Bits.RXIPV4GDFRM */
#define IFX_ETH_RXIPV4_GOOD_FRAMES_RXIPV4GDFRM_LEN (32u)

/** \brief  Mask for Ifx_ETH_RXIPV4_GOOD_FRAMES_Bits.RXIPV4GDFRM */
#define IFX_ETH_RXIPV4_GOOD_FRAMES_RXIPV4GDFRM_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_RXIPV4_GOOD_FRAMES_Bits.RXIPV4GDFRM */
#define IFX_ETH_RXIPV4_GOOD_FRAMES_RXIPV4GDFRM_OFF (0u)

/** \brief  Length for Ifx_ETH_RXIPV4_GOOD_OCTETS_Bits.RXIPV4GDOCT */
#define IFX_ETH_RXIPV4_GOOD_OCTETS_RXIPV4GDOCT_LEN (32u)

/** \brief  Mask for Ifx_ETH_RXIPV4_GOOD_OCTETS_Bits.RXIPV4GDOCT */
#define IFX_ETH_RXIPV4_GOOD_OCTETS_RXIPV4GDOCT_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_RXIPV4_GOOD_OCTETS_Bits.RXIPV4GDOCT */
#define IFX_ETH_RXIPV4_GOOD_OCTETS_RXIPV4GDOCT_OFF (0u)

/** \brief  Length for Ifx_ETH_RXIPV4_HEADER_ERROR_FRAMES_Bits.RXIPV4HDRERRFRM */
#define IFX_ETH_RXIPV4_HEADER_ERROR_FRAMES_RXIPV4HDRERRFRM_LEN (32u)

/** \brief  Mask for Ifx_ETH_RXIPV4_HEADER_ERROR_FRAMES_Bits.RXIPV4HDRERRFRM */
#define IFX_ETH_RXIPV4_HEADER_ERROR_FRAMES_RXIPV4HDRERRFRM_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_RXIPV4_HEADER_ERROR_FRAMES_Bits.RXIPV4HDRERRFRM */
#define IFX_ETH_RXIPV4_HEADER_ERROR_FRAMES_RXIPV4HDRERRFRM_OFF (0u)

/** \brief  Length for Ifx_ETH_RXIPV4_HEADER_ERROR_OCTETS_Bits.RXIPV4HDRERROCT */
#define IFX_ETH_RXIPV4_HEADER_ERROR_OCTETS_RXIPV4HDRERROCT_LEN (32u)

/** \brief  Mask for Ifx_ETH_RXIPV4_HEADER_ERROR_OCTETS_Bits.RXIPV4HDRERROCT */
#define IFX_ETH_RXIPV4_HEADER_ERROR_OCTETS_RXIPV4HDRERROCT_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_RXIPV4_HEADER_ERROR_OCTETS_Bits.RXIPV4HDRERROCT */
#define IFX_ETH_RXIPV4_HEADER_ERROR_OCTETS_RXIPV4HDRERROCT_OFF (0u)

/** \brief  Length for Ifx_ETH_RXIPV4_NO_PAYLOAD_FRAMES_Bits.RXIPV4NOPAYFRM */
#define IFX_ETH_RXIPV4_NO_PAYLOAD_FRAMES_RXIPV4NOPAYFRM_LEN (32u)

/** \brief  Mask for Ifx_ETH_RXIPV4_NO_PAYLOAD_FRAMES_Bits.RXIPV4NOPAYFRM */
#define IFX_ETH_RXIPV4_NO_PAYLOAD_FRAMES_RXIPV4NOPAYFRM_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_RXIPV4_NO_PAYLOAD_FRAMES_Bits.RXIPV4NOPAYFRM */
#define IFX_ETH_RXIPV4_NO_PAYLOAD_FRAMES_RXIPV4NOPAYFRM_OFF (0u)

/** \brief  Length for Ifx_ETH_RXIPV4_NO_PAYLOAD_OCTETS_Bits.RXIPV4NOPAYOCT */
#define IFX_ETH_RXIPV4_NO_PAYLOAD_OCTETS_RXIPV4NOPAYOCT_LEN (32u)

/** \brief  Mask for Ifx_ETH_RXIPV4_NO_PAYLOAD_OCTETS_Bits.RXIPV4NOPAYOCT */
#define IFX_ETH_RXIPV4_NO_PAYLOAD_OCTETS_RXIPV4NOPAYOCT_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_RXIPV4_NO_PAYLOAD_OCTETS_Bits.RXIPV4NOPAYOCT */
#define IFX_ETH_RXIPV4_NO_PAYLOAD_OCTETS_RXIPV4NOPAYOCT_OFF (0u)

/** \brief  Length for
 * Ifx_ETH_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS_Bits.RXIPV4UDSBLOCT */
#define IFX_ETH_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS_RXIPV4UDSBLOCT_LEN (32u)

/** \brief  Mask for
 * Ifx_ETH_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS_Bits.RXIPV4UDSBLOCT */
#define IFX_ETH_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS_RXIPV4UDSBLOCT_MSK (0xffffffffu)

/** \brief  Offset for
 * Ifx_ETH_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS_Bits.RXIPV4UDSBLOCT */
#define IFX_ETH_RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS_RXIPV4UDSBLOCT_OFF (0u)

/** \brief  Length for
 * Ifx_ETH_RXIPV4_UDP_CHECKSUM_DISABLED_FRAMES_Bits.RXIPV4UDSBLFRM */
#define IFX_ETH_RXIPV4_UDP_CHECKSUM_DISABLED_FRAMES_RXIPV4UDSBLFRM_LEN (32u)

/** \brief  Mask for
 * Ifx_ETH_RXIPV4_UDP_CHECKSUM_DISABLED_FRAMES_Bits.RXIPV4UDSBLFRM */
#define IFX_ETH_RXIPV4_UDP_CHECKSUM_DISABLED_FRAMES_RXIPV4UDSBLFRM_MSK (0xffffffffu)

/** \brief  Offset for
 * Ifx_ETH_RXIPV4_UDP_CHECKSUM_DISABLED_FRAMES_Bits.RXIPV4UDSBLFRM */
#define IFX_ETH_RXIPV4_UDP_CHECKSUM_DISABLED_FRAMES_RXIPV4UDSBLFRM_OFF (0u)

/** \brief  Length for Ifx_ETH_RXIPV6_GOOD_FRAMES_Bits.RXIPV6GDFRM */
#define IFX_ETH_RXIPV6_GOOD_FRAMES_RXIPV6GDFRM_LEN (32u)

/** \brief  Mask for Ifx_ETH_RXIPV6_GOOD_FRAMES_Bits.RXIPV6GDFRM */
#define IFX_ETH_RXIPV6_GOOD_FRAMES_RXIPV6GDFRM_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_RXIPV6_GOOD_FRAMES_Bits.RXIPV6GDFRM */
#define IFX_ETH_RXIPV6_GOOD_FRAMES_RXIPV6GDFRM_OFF (0u)

/** \brief  Length for Ifx_ETH_RXIPV6_GOOD_OCTETS_Bits.RXIPV6GDOCT */
#define IFX_ETH_RXIPV6_GOOD_OCTETS_RXIPV6GDOCT_LEN (32u)

/** \brief  Mask for Ifx_ETH_RXIPV6_GOOD_OCTETS_Bits.RXIPV6GDOCT */
#define IFX_ETH_RXIPV6_GOOD_OCTETS_RXIPV6GDOCT_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_RXIPV6_GOOD_OCTETS_Bits.RXIPV6GDOCT */
#define IFX_ETH_RXIPV6_GOOD_OCTETS_RXIPV6GDOCT_OFF (0u)

/** \brief  Length for Ifx_ETH_RXIPV6_HEADER_ERROR_FRAMES_Bits.RXIPV6HDRERRFRM */
#define IFX_ETH_RXIPV6_HEADER_ERROR_FRAMES_RXIPV6HDRERRFRM_LEN (32u)

/** \brief  Mask for Ifx_ETH_RXIPV6_HEADER_ERROR_FRAMES_Bits.RXIPV6HDRERRFRM */
#define IFX_ETH_RXIPV6_HEADER_ERROR_FRAMES_RXIPV6HDRERRFRM_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_RXIPV6_HEADER_ERROR_FRAMES_Bits.RXIPV6HDRERRFRM */
#define IFX_ETH_RXIPV6_HEADER_ERROR_FRAMES_RXIPV6HDRERRFRM_OFF (0u)

