xiongGithub1/autosarTc234/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC23X_AB_PB_BASE_V501_REL-334/TC23x_ABstep/Aurix_MC-ISAR/general/tricore/inc/TC23x/IfxEth_bf.h
/** \brief  Length for Ifx_ETH_RXIPV6_HEADER_ERROR_OCTETS_Bits.RXIPV6HDRERROCT */
#define IFX_ETH_RXIPV6_HEADER_ERROR_OCTETS_RXIPV6HDRERROCT_LEN (32u)

/** \brief  Mask for Ifx_ETH_RXIPV6_HEADER_ERROR_OCTETS_Bits.RXIPV6HDRERROCT */
#define IFX_ETH_RXIPV6_HEADER_ERROR_OCTETS_RXIPV6HDRERROCT_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_RXIPV6_HEADER_ERROR_OCTETS_Bits.RXIPV6HDRERROCT */
#define IFX_ETH_RXIPV6_HEADER_ERROR_OCTETS_RXIPV6HDRERROCT_OFF (0u)

/** \brief  Length for Ifx_ETH_RXIPV6_NO_PAYLOAD_FRAMES_Bits.RXIPV6NOPAYFRM */
#define IFX_ETH_RXIPV6_NO_PAYLOAD_FRAMES_RXIPV6NOPAYFRM_LEN (32u)

/** \brief  Mask for Ifx_ETH_RXIPV6_NO_PAYLOAD_FRAMES_Bits.RXIPV6NOPAYFRM */
#define IFX_ETH_RXIPV6_NO_PAYLOAD_FRAMES_RXIPV6NOPAYFRM_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_RXIPV6_NO_PAYLOAD_FRAMES_Bits.RXIPV6NOPAYFRM */
#define IFX_ETH_RXIPV6_NO_PAYLOAD_FRAMES_RXIPV6NOPAYFRM_OFF (0u)

/** \brief  Length for Ifx_ETH_RXIPV6_NO_PAYLOAD_OCTETS_Bits.RXIPV6NOPAYOCT */
#define IFX_ETH_RXIPV6_NO_PAYLOAD_OCTETS_RXIPV6NOPAYOCT_LEN (32u)

/** \brief  Mask for Ifx_ETH_RXIPV6_NO_PAYLOAD_OCTETS_Bits.RXIPV6NOPAYOCT */
#define IFX_ETH_RXIPV6_NO_PAYLOAD_OCTETS_RXIPV6NOPAYOCT_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_RXIPV6_NO_PAYLOAD_OCTETS_Bits.RXIPV6NOPAYOCT */
#define IFX_ETH_RXIPV6_NO_PAYLOAD_OCTETS_RXIPV6NOPAYOCT_OFF (0u)

/** \brief  Length for Ifx_ETH_RXTCP_ERROR_FRAMES_Bits.RXTCPERRFRM */
#define IFX_ETH_RXTCP_ERROR_FRAMES_RXTCPERRFRM_LEN (32u)

/** \brief  Mask for Ifx_ETH_RXTCP_ERROR_FRAMES_Bits.RXTCPERRFRM */
#define IFX_ETH_RXTCP_ERROR_FRAMES_RXTCPERRFRM_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_RXTCP_ERROR_FRAMES_Bits.RXTCPERRFRM */
#define IFX_ETH_RXTCP_ERROR_FRAMES_RXTCPERRFRM_OFF (0u)

/** \brief  Length for Ifx_ETH_RXTCP_ERROR_OCTETS_Bits.RXTCPERROCT */
#define IFX_ETH_RXTCP_ERROR_OCTETS_RXTCPERROCT_LEN (32u)

/** \brief  Mask for Ifx_ETH_RXTCP_ERROR_OCTETS_Bits.RXTCPERROCT */
#define IFX_ETH_RXTCP_ERROR_OCTETS_RXTCPERROCT_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_RXTCP_ERROR_OCTETS_Bits.RXTCPERROCT */
#define IFX_ETH_RXTCP_ERROR_OCTETS_RXTCPERROCT_OFF (0u)

/** \brief  Length for Ifx_ETH_RXTCP_GOOD_FRAMES_Bits.RXTCPGDFRM */
#define IFX_ETH_RXTCP_GOOD_FRAMES_RXTCPGDFRM_LEN (32u)

/** \brief  Mask for Ifx_ETH_RXTCP_GOOD_FRAMES_Bits.RXTCPGDFRM */
#define IFX_ETH_RXTCP_GOOD_FRAMES_RXTCPGDFRM_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_RXTCP_GOOD_FRAMES_Bits.RXTCPGDFRM */
#define IFX_ETH_RXTCP_GOOD_FRAMES_RXTCPGDFRM_OFF (0u)

/** \brief  Length for Ifx_ETH_RXTCP_GOOD_OCTETS_Bits.RXTCPGDOCT */
#define IFX_ETH_RXTCP_GOOD_OCTETS_RXTCPGDOCT_LEN (32u)

/** \brief  Mask for Ifx_ETH_RXTCP_GOOD_OCTETS_Bits.RXTCPGDOCT */
#define IFX_ETH_RXTCP_GOOD_OCTETS_RXTCPGDOCT_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_RXTCP_GOOD_OCTETS_Bits.RXTCPGDOCT */
#define IFX_ETH_RXTCP_GOOD_OCTETS_RXTCPGDOCT_OFF (0u)

/** \brief  Length for Ifx_ETH_RXUDP_ERROR_FRAMES_Bits.RXUDPERRFRM */
#define IFX_ETH_RXUDP_ERROR_FRAMES_RXUDPERRFRM_LEN (32u)

/** \brief  Mask for Ifx_ETH_RXUDP_ERROR_FRAMES_Bits.RXUDPERRFRM */
#define IFX_ETH_RXUDP_ERROR_FRAMES_RXUDPERRFRM_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_RXUDP_ERROR_FRAMES_Bits.RXUDPERRFRM */
#define IFX_ETH_RXUDP_ERROR_FRAMES_RXUDPERRFRM_OFF (0u)

/** \brief  Length for Ifx_ETH_RXUDP_ERROR_OCTETS_Bits.RXUDPERROCT */
#define IFX_ETH_RXUDP_ERROR_OCTETS_RXUDPERROCT_LEN (32u)

/** \brief  Mask for Ifx_ETH_RXUDP_ERROR_OCTETS_Bits.RXUDPERROCT */
#define IFX_ETH_RXUDP_ERROR_OCTETS_RXUDPERROCT_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_RXUDP_ERROR_OCTETS_Bits.RXUDPERROCT */
#define IFX_ETH_RXUDP_ERROR_OCTETS_RXUDPERROCT_OFF (0u)

/** \brief  Length for Ifx_ETH_RXUDP_GOOD_FRAMES_Bits.RXUDPGDFRM */
#define IFX_ETH_RXUDP_GOOD_FRAMES_RXUDPGDFRM_LEN (32u)

/** \brief  Mask for Ifx_ETH_RXUDP_GOOD_FRAMES_Bits.RXUDPGDFRM */
#define IFX_ETH_RXUDP_GOOD_FRAMES_RXUDPGDFRM_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_RXUDP_GOOD_FRAMES_Bits.RXUDPGDFRM */
#define IFX_ETH_RXUDP_GOOD_FRAMES_RXUDPGDFRM_OFF (0u)

/** \brief  Length for Ifx_ETH_RXUDP_GOOD_OCTETS_Bits.RXUDPGDOCT */
#define IFX_ETH_RXUDP_GOOD_OCTETS_RXUDPGDOCT_LEN (32u)

/** \brief  Mask for Ifx_ETH_RXUDP_GOOD_OCTETS_Bits.RXUDPGDOCT */
#define IFX_ETH_RXUDP_GOOD_OCTETS_RXUDPGDOCT_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_RXUDP_GOOD_OCTETS_Bits.RXUDPGDOCT */
#define IFX_ETH_RXUDP_GOOD_OCTETS_RXUDPGDOCT_OFF (0u)

/** \brief  Length for Ifx_ETH_STATUS_Bits.AIS */
#define IFX_ETH_STATUS_AIS_LEN (1u)

/** \brief  Mask for Ifx_ETH_STATUS_Bits.AIS */
#define IFX_ETH_STATUS_AIS_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_STATUS_Bits.AIS */
#define IFX_ETH_STATUS_AIS_OFF (15u)

/** \brief  Length for Ifx_ETH_STATUS_Bits.EB */
#define IFX_ETH_STATUS_EB_LEN (3u)

/** \brief  Mask for Ifx_ETH_STATUS_Bits.EB */
#define IFX_ETH_STATUS_EB_MSK (0x7u)

/** \brief  Offset for Ifx_ETH_STATUS_Bits.EB */
#define IFX_ETH_STATUS_EB_OFF (23u)

/** \brief  Length for Ifx_ETH_STATUS_Bits.ERI */
#define IFX_ETH_STATUS_ERI_LEN (1u)

/** \brief  Mask for Ifx_ETH_STATUS_Bits.ERI */
#define IFX_ETH_STATUS_ERI_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_STATUS_Bits.ERI */
#define IFX_ETH_STATUS_ERI_OFF (14u)

/** \brief  Length for Ifx_ETH_STATUS_Bits.ETI */
#define IFX_ETH_STATUS_ETI_LEN (1u)

/** \brief  Mask for Ifx_ETH_STATUS_Bits.ETI */
#define IFX_ETH_STATUS_ETI_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_STATUS_Bits.ETI */
#define IFX_ETH_STATUS_ETI_OFF (10u)

/** \brief  Length for Ifx_ETH_STATUS_Bits.FBI */
#define IFX_ETH_STATUS_FBI_LEN (1u)

/** \brief  Mask for Ifx_ETH_STATUS_Bits.FBI */
#define IFX_ETH_STATUS_FBI_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_STATUS_Bits.FBI */
#define IFX_ETH_STATUS_FBI_OFF (13u)

/** \brief  Length for Ifx_ETH_STATUS_Bits.GLI */
#define IFX_ETH_STATUS_GLI_LEN (1u)

/** \brief  Mask for Ifx_ETH_STATUS_Bits.GLI */
#define IFX_ETH_STATUS_GLI_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_STATUS_Bits.GLI */
#define IFX_ETH_STATUS_GLI_OFF (26u)

/** \brief  Length for Ifx_ETH_STATUS_Bits.GLPII */
#define IFX_ETH_STATUS_GLPII_LEN (1u)

/** \brief  Mask for Ifx_ETH_STATUS_Bits.GLPII */
#define IFX_ETH_STATUS_GLPII_MSK (0x1u)

