xiongGithub1/autosarTc234/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC23X_AB_PB_BASE_V501_REL-334/TC23x_ABstep/Aurix_MC-ISAR/general/tricore/inc/TC23x/IfxEth_bf.h
/** \brief  Offset for Ifx_ETH_TX_DEFERRED_FRAMES_Bits.TXDEFRD */
#define IFX_ETH_TX_DEFERRED_FRAMES_TXDEFRD_OFF (0u)

/** \brief  Length for Ifx_ETH_TX_EXCESSIVE_COLLISION_FRAMES_Bits.TXEXSCOL */
#define IFX_ETH_TX_EXCESSIVE_COLLISION_FRAMES_TXEXSCOL_LEN (32u)

/** \brief  Mask for Ifx_ETH_TX_EXCESSIVE_COLLISION_FRAMES_Bits.TXEXSCOL */
#define IFX_ETH_TX_EXCESSIVE_COLLISION_FRAMES_TXEXSCOL_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_TX_EXCESSIVE_COLLISION_FRAMES_Bits.TXEXSCOL */
#define IFX_ETH_TX_EXCESSIVE_COLLISION_FRAMES_TXEXSCOL_OFF (0u)

/** \brief  Length for Ifx_ETH_TX_EXCESSIVE_DEFERRAL_ERROR_Bits.TXEXSDEF */
#define IFX_ETH_TX_EXCESSIVE_DEFERRAL_ERROR_TXEXSDEF_LEN (32u)

/** \brief  Mask for Ifx_ETH_TX_EXCESSIVE_DEFERRAL_ERROR_Bits.TXEXSDEF */
#define IFX_ETH_TX_EXCESSIVE_DEFERRAL_ERROR_TXEXSDEF_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_TX_EXCESSIVE_DEFERRAL_ERROR_Bits.TXEXSDEF */
#define IFX_ETH_TX_EXCESSIVE_DEFERRAL_ERROR_TXEXSDEF_OFF (0u)

/** \brief  Length for Ifx_ETH_TX_FRAME_COUNT_GOOD_BAD_Bits.TXFRMGB */
#define IFX_ETH_TX_FRAME_COUNT_GOOD_BAD_TXFRMGB_LEN (32u)

/** \brief  Mask for Ifx_ETH_TX_FRAME_COUNT_GOOD_BAD_Bits.TXFRMGB */
#define IFX_ETH_TX_FRAME_COUNT_GOOD_BAD_TXFRMGB_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_TX_FRAME_COUNT_GOOD_BAD_Bits.TXFRMGB */
#define IFX_ETH_TX_FRAME_COUNT_GOOD_BAD_TXFRMGB_OFF (0u)

/** \brief  Length for Ifx_ETH_TX_FRAME_COUNT_GOOD_Bits.TXFRMG */
#define IFX_ETH_TX_FRAME_COUNT_GOOD_TXFRMG_LEN (32u)

/** \brief  Mask for Ifx_ETH_TX_FRAME_COUNT_GOOD_Bits.TXFRMG */
#define IFX_ETH_TX_FRAME_COUNT_GOOD_TXFRMG_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_TX_FRAME_COUNT_GOOD_Bits.TXFRMG */
#define IFX_ETH_TX_FRAME_COUNT_GOOD_TXFRMG_OFF (0u)

/** \brief  Length for Ifx_ETH_TX_LATE_COLLISION_FRAMES_Bits.TXLATECOL */
#define IFX_ETH_TX_LATE_COLLISION_FRAMES_TXLATECOL_LEN (32u)

/** \brief  Mask for Ifx_ETH_TX_LATE_COLLISION_FRAMES_Bits.TXLATECOL */
#define IFX_ETH_TX_LATE_COLLISION_FRAMES_TXLATECOL_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_TX_LATE_COLLISION_FRAMES_Bits.TXLATECOL */
#define IFX_ETH_TX_LATE_COLLISION_FRAMES_TXLATECOL_OFF (0u)

/** \brief  Length for Ifx_ETH_TX_MULTICAST_FRAMES_GOOD_BAD_Bits.TXMCASTGB */
#define IFX_ETH_TX_MULTICAST_FRAMES_GOOD_BAD_TXMCASTGB_LEN (32u)

/** \brief  Mask for Ifx_ETH_TX_MULTICAST_FRAMES_GOOD_BAD_Bits.TXMCASTGB */
#define IFX_ETH_TX_MULTICAST_FRAMES_GOOD_BAD_TXMCASTGB_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_TX_MULTICAST_FRAMES_GOOD_BAD_Bits.TXMCASTGB */
#define IFX_ETH_TX_MULTICAST_FRAMES_GOOD_BAD_TXMCASTGB_OFF (0u)

/** \brief  Length for Ifx_ETH_TX_MULTICAST_FRAMES_GOOD_Bits.TXMCASTG */
#define IFX_ETH_TX_MULTICAST_FRAMES_GOOD_TXMCASTG_LEN (32u)

/** \brief  Mask for Ifx_ETH_TX_MULTICAST_FRAMES_GOOD_Bits.TXMCASTG */
#define IFX_ETH_TX_MULTICAST_FRAMES_GOOD_TXMCASTG_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_TX_MULTICAST_FRAMES_GOOD_Bits.TXMCASTG */
#define IFX_ETH_TX_MULTICAST_FRAMES_GOOD_TXMCASTG_OFF (0u)

/** \brief  Length for Ifx_ETH_TX_MULTIPLE_COLLISION_GOOD_FRAMES_Bits.TXMULTCOLG */
#define IFX_ETH_TX_MULTIPLE_COLLISION_GOOD_FRAMES_TXMULTCOLG_LEN (32u)

/** \brief  Mask for Ifx_ETH_TX_MULTIPLE_COLLISION_GOOD_FRAMES_Bits.TXMULTCOLG */
#define IFX_ETH_TX_MULTIPLE_COLLISION_GOOD_FRAMES_TXMULTCOLG_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_TX_MULTIPLE_COLLISION_GOOD_FRAMES_Bits.TXMULTCOLG */
#define IFX_ETH_TX_MULTIPLE_COLLISION_GOOD_FRAMES_TXMULTCOLG_OFF (0u)

/** \brief  Length for Ifx_ETH_TX_OCTET_COUNT_GOOD_BAD_Bits.TXOCTGB */
#define IFX_ETH_TX_OCTET_COUNT_GOOD_BAD_TXOCTGB_LEN (32u)

/** \brief  Mask for Ifx_ETH_TX_OCTET_COUNT_GOOD_BAD_Bits.TXOCTGB */
#define IFX_ETH_TX_OCTET_COUNT_GOOD_BAD_TXOCTGB_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_TX_OCTET_COUNT_GOOD_BAD_Bits.TXOCTGB */
#define IFX_ETH_TX_OCTET_COUNT_GOOD_BAD_TXOCTGB_OFF (0u)

/** \brief  Length for Ifx_ETH_TX_OCTET_COUNT_GOOD_Bits.TXOCTG */
#define IFX_ETH_TX_OCTET_COUNT_GOOD_TXOCTG_LEN (32u)

/** \brief  Mask for Ifx_ETH_TX_OCTET_COUNT_GOOD_Bits.TXOCTG */
#define IFX_ETH_TX_OCTET_COUNT_GOOD_TXOCTG_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_TX_OCTET_COUNT_GOOD_Bits.TXOCTG */
#define IFX_ETH_TX_OCTET_COUNT_GOOD_TXOCTG_OFF (0u)

/** \brief  Length for Ifx_ETH_TX_OSIZE_FRAMES_GOOD_Bits.TXOSIZG */
#define IFX_ETH_TX_OSIZE_FRAMES_GOOD_TXOSIZG_LEN (32u)

/** \brief  Mask for Ifx_ETH_TX_OSIZE_FRAMES_GOOD_Bits.TXOSIZG */
#define IFX_ETH_TX_OSIZE_FRAMES_GOOD_TXOSIZG_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_TX_OSIZE_FRAMES_GOOD_Bits.TXOSIZG */
#define IFX_ETH_TX_OSIZE_FRAMES_GOOD_TXOSIZG_OFF (0u)

/** \brief  Length for Ifx_ETH_TX_PAUSE_FRAMES_Bits.TXPAUSE */
#define IFX_ETH_TX_PAUSE_FRAMES_TXPAUSE_LEN (32u)

/** \brief  Mask for Ifx_ETH_TX_PAUSE_FRAMES_Bits.TXPAUSE */
#define IFX_ETH_TX_PAUSE_FRAMES_TXPAUSE_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_TX_PAUSE_FRAMES_Bits.TXPAUSE */
#define IFX_ETH_TX_PAUSE_FRAMES_TXPAUSE_OFF (0u)

/** \brief  Length for Ifx_ETH_TX_SINGLE_COLLISION_GOOD_FRAMES_Bits.TXSNGLCOLG */
#define IFX_ETH_TX_SINGLE_COLLISION_GOOD_FRAMES_TXSNGLCOLG_LEN (32u)

/** \brief  Mask for Ifx_ETH_TX_SINGLE_COLLISION_GOOD_FRAMES_Bits.TXSNGLCOLG */
#define IFX_ETH_TX_SINGLE_COLLISION_GOOD_FRAMES_TXSNGLCOLG_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_TX_SINGLE_COLLISION_GOOD_FRAMES_Bits.TXSNGLCOLG */
#define IFX_ETH_TX_SINGLE_COLLISION_GOOD_FRAMES_TXSNGLCOLG_OFF (0u)

/** \brief  Length for Ifx_ETH_TX_UNDERFLOW_ERROR_FRAMES_Bits.TXUNDRFLW */
#define IFX_ETH_TX_UNDERFLOW_ERROR_FRAMES_TXUNDRFLW_LEN (32u)

/** \brief  Mask for Ifx_ETH_TX_UNDERFLOW_ERROR_FRAMES_Bits.TXUNDRFLW */
#define IFX_ETH_TX_UNDERFLOW_ERROR_FRAMES_TXUNDRFLW_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_TX_UNDERFLOW_ERROR_FRAMES_Bits.TXUNDRFLW */
#define IFX_ETH_TX_UNDERFLOW_ERROR_FRAMES_TXUNDRFLW_OFF (0u)

/** \brief  Length for Ifx_ETH_TX_UNICAST_FRAMES_GOOD_BAD_Bits.TXUCASTGB */
#define IFX_ETH_TX_UNICAST_FRAMES_GOOD_BAD_TXUCASTGB_LEN (32u)

/** \brief  Mask for Ifx_ETH_TX_UNICAST_FRAMES_GOOD_BAD_Bits.TXUCASTGB */
#define IFX_ETH_TX_UNICAST_FRAMES_GOOD_BAD_TXUCASTGB_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_TX_UNICAST_FRAMES_GOOD_BAD_Bits.TXUCASTGB */
#define IFX_ETH_TX_UNICAST_FRAMES_GOOD_BAD_TXUCASTGB_OFF (0u)

/** \brief  Length for Ifx_ETH_TX_VLAN_FRAMES_GOOD_Bits.TXVLANG */
#define IFX_ETH_TX_VLAN_FRAMES_GOOD_TXVLANG_LEN (32u)

