xiongGithub1/autosarTc234/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC23X_AB_PB_BASE_V501_REL-334/TC23x_ABstep/Aurix_MC-ISAR/general/tricore/inc/TC23x/IfxEth_bf.h
/** \brief  Mask for Ifx_ETH_TX_VLAN_FRAMES_GOOD_Bits.TXVLANG */
#define IFX_ETH_TX_VLAN_FRAMES_GOOD_TXVLANG_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ETH_TX_VLAN_FRAMES_GOOD_Bits.TXVLANG */
#define IFX_ETH_TX_VLAN_FRAMES_GOOD_TXVLANG_OFF (0u)

/** \brief  Length for Ifx_ETH_VERSION_Bits.SNPSVER */
#define IFX_ETH_VERSION_SNPSVER_LEN (8u)

/** \brief  Mask for Ifx_ETH_VERSION_Bits.SNPSVER */
#define IFX_ETH_VERSION_SNPSVER_MSK (0xffu)

/** \brief  Offset for Ifx_ETH_VERSION_Bits.SNPSVER */
#define IFX_ETH_VERSION_SNPSVER_OFF (0u)

/** \brief  Length for Ifx_ETH_VERSION_Bits.USERVER */
#define IFX_ETH_VERSION_USERVER_LEN (8u)

/** \brief  Mask for Ifx_ETH_VERSION_Bits.USERVER */
#define IFX_ETH_VERSION_USERVER_MSK (0xffu)

/** \brief  Offset for Ifx_ETH_VERSION_Bits.USERVER */
#define IFX_ETH_VERSION_USERVER_OFF (8u)

/** \brief  Length for Ifx_ETH_VLAN_TAG_Bits.ESVL */
#define IFX_ETH_VLAN_TAG_ESVL_LEN (1u)

/** \brief  Mask for Ifx_ETH_VLAN_TAG_Bits.ESVL */
#define IFX_ETH_VLAN_TAG_ESVL_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_VLAN_TAG_Bits.ESVL */
#define IFX_ETH_VLAN_TAG_ESVL_OFF (18u)

/** \brief  Length for Ifx_ETH_VLAN_TAG_Bits.ETV */
#define IFX_ETH_VLAN_TAG_ETV_LEN (1u)

/** \brief  Mask for Ifx_ETH_VLAN_TAG_Bits.ETV */
#define IFX_ETH_VLAN_TAG_ETV_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_VLAN_TAG_Bits.ETV */
#define IFX_ETH_VLAN_TAG_ETV_OFF (16u)

/** \brief  Length for Ifx_ETH_VLAN_TAG_Bits.VL */
#define IFX_ETH_VLAN_TAG_VL_LEN (16u)

/** \brief  Mask for Ifx_ETH_VLAN_TAG_Bits.VL */
#define IFX_ETH_VLAN_TAG_VL_MSK (0xffffu)

/** \brief  Offset for Ifx_ETH_VLAN_TAG_Bits.VL */
#define IFX_ETH_VLAN_TAG_VL_OFF (0u)

/** \brief  Length for Ifx_ETH_VLAN_TAG_Bits.VTHM */
#define IFX_ETH_VLAN_TAG_VTHM_LEN (1u)

/** \brief  Mask for Ifx_ETH_VLAN_TAG_Bits.VTHM */
#define IFX_ETH_VLAN_TAG_VTHM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_VLAN_TAG_Bits.VTHM */
#define IFX_ETH_VLAN_TAG_VTHM_OFF (19u)

/** \brief  Length for Ifx_ETH_VLAN_TAG_Bits.VTIM */
#define IFX_ETH_VLAN_TAG_VTIM_LEN (1u)

/** \brief  Mask for Ifx_ETH_VLAN_TAG_Bits.VTIM */
#define IFX_ETH_VLAN_TAG_VTIM_MSK (0x1u)

/** \brief  Offset for Ifx_ETH_VLAN_TAG_Bits.VTIM */
#define IFX_ETH_VLAN_TAG_VTIM_OFF (17u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXETH_BF_H */
